{"checkListAll":{"evaluationChecklist":{"storageVersion":"19","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.192Z","createUser":"rex.nethercott","updateDts":"2017-10-11T20:51:52.955Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","checklistTemplateId":"8e0cb04b-298e-4cea-9986-5295f73110fd","evaluationId":"741a5ef6-f0f2-426e-80a7-df454e0703f1","summary":"<p><strong>Definitions</strong></p>\n<p><strong>1. Malhar</strong></p>\n<p>Malhar is an open source codec and operator library.</p>\n<p><strong>2. Apex</strong></p>\n<p>The interface between the hadoop clusters and the intructions for the hadoop clusters.</p>\n<p><strong>3. Hadoop Clusters</strong></p>\n<p>Collection of Nodes that have been assigned work to perform.</p>\n<p><strong>4. Java programming language</strong></p>\n<p>Language used to write programs that can use the Malhar library. Source code can then be changed into .apa programs so that they can be run by Apex.</p>\n<p><strong>5. Apache Maven</strong></p>\n<p>Maven is a software project management and comprehension tool.</p>\n<p>&nbsp;</p>\n<p>Apache apex requires previous knowledge about data streaming services to fully leverage. It also has a high barrier to entry. In light of this, high scores were given for a number of factors where the developers went to exceptional lengths to lower the barrier to entry and make the asset easier to use.</p>\n<p>Some of these items are listed here:</p>\n<p>1. A VM is provided(from data torrent) with Apex and Hadoop services pre-installed.</p>\n<p>2. A Docker image is provided with Apex and Hadoop services pre-installed.</p>\n<p>3. It is possible to create \"Apex Applications\" that simulate similiar behavior as if they were run on clusters. These \"Apex Applications\" can be run without installing Apex.</p>\n<p>4. There is a large amount of documentation detailing test cases, test data, use cases, and example problems.&nbsp;</p>\n<p>Lower scores were awarded to Apache Apex principally due to the lack of documentation detailing things such as performance, I/O testing, and Error handling.</p>\n<p>&nbsp;</p>\n<p>Here is included a discussion on the testing that was done for this evaluation.</p>\n<p>For the tests that were performed the tester followed an online tutorial to create&nbsp;two apex programs.</p>\n<p>The first one would basically take in a number of input files, count the words in the files and output the word frequency of all the input files. The tester was not able to complete this test due to errors encountered when \"launching\" the apex program. &nbsp;To be clear this asset is used by many companies and can integrate with many other products and apache services, see <a href=\"https://apex.apache.org/powered-by-apex.html\">here</a>. This summary is simply stating that the tester was unable to complete testing due to errors encountered while following the online tutorial step.</p>\n<p>For the second test, the tester followed online instructions to compute pi using a monte carlo scheme. The results of this test are shown in the testing section.&nbsp;</p>\n<h3>Final summary review after completing testing.</h3>\n<p>Apex is a powerful and easy to implement stream processor made by Datatorrent and configured to run on hadoop services. Along with the concept of operators,(ways to pipe data to and from nodes for processing) it also has access to the Malhar library.(A large collection of prebuilt operators) Thus enabling users to get up and running quickly without the need to worry about how to receive, process and send data to other nodes in the graph.&nbsp;</p>\n<p>One convenient way to think of how apex works is by visualizing a Directed Acyclic Graph. Where the edges are the data streams and the nodes are the \"operators\" that are receiving, processing and sending the data to another stream. In a sense each operator has an \"input\" port and an \"output\" port. The data streams are merely starting at a node, getting processed, and then get piped into other nodes. Now that we have the idea of the nodes and the edges, or more specifically the operators and the data streams we can now \"distribute\" the \"nodes\" across the cluster and simply pipe the data to and from these individual nodes on the cluster.&nbsp;</p>\n<p>In dealing with faults and outages there is a runtime component that running alongside the application, and when a \"node\" or operator goes down it is restored to a valid state or an earlier \"checkpoint\" where state is preserved. With regards to scalability the \"nodes\" can be broken down and partitioned into multiple instances to allow for handling larger amounts of data. Finally the operational insight tool shows how each data point is performing and can record data.</p>\n<p>&nbsp;</p>\n<p>The following video is reccomended for greater understanding of Apex and its functions.</p>\n<p><a href=\"https://www.youtube.com/watch?v=z6RdpT50G_o\">https://www.youtube.com/watch?v=z6RdpT50G_o</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>","workflowStatus":"OPEN"},"recommendations":[{"storageVersion":"1","activeStatus":"A","adminModified":false,"createDts":"2017-09-12T14:25:05.737Z","createUser":"brigham.michaelis","updateDts":"2017-09-12T14:25:05.737Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","reason":"","recommendation":"<p>Provide an intro-video detailing how Apex works and what are some of it's applications.</p>","recommendationId":"209c132a-3fa0-46cf-a2a1-9a991e6130b2","recommendationType":"DOCS","recommendationTypeDescription":"Documentation"},{"storageVersion":"1","activeStatus":"A","adminModified":false,"createDts":"2017-10-04T19:43:25.144Z","createUser":"brigham.michaelis","updateDts":"2017-10-04T19:43:25.144Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","reason":"","recommendation":"<p>Show potential users how to run apex from docker or a VM.</p>","recommendationId":"445982df-1a53-4de3-92ad-e0cf116b503b","recommendationType":"EUSE","recommendationTypeDescription":"Ease of use"}],"responses":[{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.195Z","createUser":"rex.nethercott","updateDts":"2017-09-26T20:22:15.693Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"2cd9b0d3-7e2a-45a6-80f3-fc371b0b950e","response":"<p>Links to the asset repository or homepage show up on page 1-3 of Google search results using key terms (list the key terms used)&nbsp;<strong>+1</strong></p> \n<p>The asset description is accessible via the Internet (Open Internet, Intelink, etc)&nbsp;<strong>+1</strong></p> \n<p>Asset description is complete&nbsp;<strong>+1</strong></p> \n<p>The asset description is current and updated regularly&nbsp;<strong>+1</strong></p> \n<p>The asset description does NOT require login to access&nbsp;<strong>+1</strong></p> \n<p><strong>Search Terms:</strong></p> \n<p><strong>\"apache apex\"</strong></p>","responseId":"0d98b67b-312c-49ab-b151-da3f3ccac61a","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:35:49.163Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:35:49.163Z","updateUser":"devin.shurtleff","evaluationSection":"DIS","narrative":"<p>First of all, this question deals with who the main customer is for DI2E Framework assets.&nbsp; The main customer is a developer who is designing and building a solution to a particular problem, and wants to know whether&nbsp;there are any re-usable assets that exist that they can leverage in their solution.&nbsp; If an asset does exist, but the developers who need to re-use the asset&nbsp;cannot find the asset, the asset is not really re-usable in the grand scheme of things.&nbsp;</p> \n<p>The idea here is to think about how a developer would look for an asset if they didn't know the asset existed. &nbsp;They won't necessarily know the name of the asset or the asset owner - instead they will search on terms associated with the functionality they are interested in by typing those terms into Google and/or an Intelink search and reviewing the first few pages of results. &nbsp;What we are looking for is \"hits\" on the asset within the first few pages of results. &nbsp;If the search results do return hits on the asset but the hits are buried somewhere after page 3 of results, then the developer will likely not find them. &nbsp;Also, the hits should link to a good description of the asset. &nbsp;</p> \n<p>This is all enabled by having a full description of the asset (full = functionality of the asset is described in various layman's&nbsp;<em>and</em>&nbsp;expert terms) in a place that Internet and/or major DoD/IC search engines can crawl and index (e.g., on a public web page or, if the asset is FOUO on Intelink).&nbsp; If, for example, a web page that describes the asset is kept behind a firewall such that no search engine crawlers can access it, the developer searching for the asset using well-known search tools will not be able to find it.</p> \n<p>This is just as applicable for COTS products as it is for FOSS or GOSS.</p> \n<p>&nbsp;</p> \n<p>Please leave a question in the comments section below if more clarification is needed.&nbsp;</p>","objective":"<p>Developers generally use a search engine or a well-known registry (e.g.,&nbsp;<a href=\"http://www.programmableweb.com/\" rel=\"nofollow\">http://www.programmableweb.com</a>&nbsp;) to find things. Keying terms associated with the asset's functionality into a search engine should get \"hits\" on the asset within the first few pages of results. How do developers look for an asset if they don't know the asset's name or even if it exists?</p> \n<p>Search engines index web pages. To help developers find your asset, a public web page containing the following should be made available:</p> \n<ol> \n <li>Which versions of the asset are currently available&nbsp;</li> \n <li>A narrative of the asset's functionality (i.e., what the asset \"does\")&nbsp;</li> \n <li>Any APIs and supported protocols associated with the asset</li> \n</ol> \n<p>It is important to provide up-to-date information so that the actual data indexed by search engines is&nbsp;<em>current</em>. Make sure the public web pages have enough information to assist the potential consumer to make an informed decision about whether or not the asset can meet their needs.&nbsp;</p>","qid":"10","question":"<p><span>How do you expect customers to find your asset</span>?</p> \n<p>Please list the search terms you would expect a customer to use, and provide links to any associated public descriptions of the asset.</p>","questionId":"2cd9b0d3-7e2a-45a6-80f3-fc371b0b950e","scoreCriteria":"<div class=\"table-wrap\"> \n <p>Links to the asset repository or homepage show up on page 1-3 of Google search results using key terms (list the key terms used)&nbsp;<strong>+1</strong></p> \n <p>The asset description is accessible via the Internet (Open Internet, Intelink, etc)&nbsp;<strong>+1</strong></p> \n <p>Asset description is complete&nbsp;<strong>+1</strong></p> \n <p>The asset description is current and updated regularly&nbsp;<strong>+1</strong></p> \n <p>The asset description does NOT require login to access&nbsp;<strong>+1</strong></p> \n <p>&nbsp;</p> \n</div> \n<p><strong>Add the numbers to the right of each item above to get the score. If none are selected, minimum score is 1.</strong></p>","evaluationSectionDescription":"Discoverable"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.197Z","createUser":"rex.nethercott","updateDts":"2017-09-26T20:23:45.268Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"195da991-3055-4ce2-a455-2512b4b69008","response":"<p>Navigate to public website and download/use/instantiate&nbsp;- no credentials required&nbsp;<strong>5</strong></p> \n<p>The public website is:</p> \n<p><a href=\"https://apex.apache.org/downloads.html\" rel=\"nofollow\">https://apex.apache.org/downloads.html</a></p> \n<p>&nbsp;</p>","responseId":"f5f7a3b7-0d29-49f7-857a-2959d93c5e30","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:36:55.54Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:36:55.54Z","updateUser":"devin.shurtleff","evaluationSection":"ACC","narrative":"<p>This question is concerned not so much with the description of the asset, but with the asset itself and whether a developer can actually get access to the asset.&nbsp; The customer for the asset in this case is the developer who wants to re-use the asset, so the&nbsp;developer is interested in where they can either download the asset binaries and/or buildable&nbsp;source code.&nbsp; These places need to be stable and accessible.&nbsp; So, for example if the asset binaries and source code is kept in a repository behind a firewall that nobody outside that firewall can get to, it is not accessible.&nbsp; If the URLs to the asset download page keeps changing, it is not in a stable location.&nbsp;</p> \n<p>For GOTS and GOSS assets, both the binaries and the source code \"belong\" to the government, and therefore both should be accessible to developers of government programs. &nbsp;In today's world, accessible means that you can download via the Internet, and/or via NIPR, SIPR, or JWICS depending on the classification of the asset. &nbsp;In the case of COTS, it is expected that only the binaries will be made available and accessible, and that accessible in this case means that a developer can download the binaries via the Internet. &nbsp;They may need a license key to \"unlock\" the binaries, but otherwise the binaries are accessible. &nbsp; &nbsp;</p> \n<p>NOTE: For both&nbsp;GOSS and FOSS, by definition, both the source and binaries should be made available. &nbsp;If&nbsp;only the binaries are made available or if only the source is made available and you have to build the source to get a binary, the \"score\" should be lowered by at least one over what you would give if both the binaries and source are available. &nbsp;&nbsp;</p> \n<p>Please leave a question in the comments section below if more clarification is needed.&nbsp;</p>","objective":"<p>Identify any extra steps developers need to go through to be able to download the asset. In some cases, the asset package is hosted in a repository that does not require any special credentials to access in a read-only fashion. In other cases, the developers may need to purchase the asset before they can download it.</p>","qid":"20","question":"<p><span>Which of the following</span>&nbsp;does a&nbsp;<span>customer</span>&nbsp;need to do to use the asset?</p> \n<ol> \n <li>Navigate to public website and download/use/instantiate - no credentials required.</li> \n <li>Register on public website and then&nbsp;download/use/instantiate.</li> \n <li>Purchase the asset and then&nbsp;download/use/instantiate.</li> \n <li>Contact the owner (vendor/PMO) and&nbsp;then&nbsp;download/use/instantiate.</li> \n <li>Contact the owner (vendor/pmo) and&nbsp;get it mailed to them.</li> \n <li>Other (Please specify).</li> \n</ol> \n<p>Please provide links to the asset, or to instructions on how to retrieve the asset.</p>","questionId":"195da991-3055-4ce2-a455-2512b4b69008","scoreCriteria":"<p>Navigate to public website and download/use/instantiate&nbsp;- no credentials required&nbsp;<strong>5</strong></p> \n<p>Register on public website and then download/use/instantiate&nbsp;<strong>4</strong></p> \n<p>Purchase the asset and then download/use/instantiate&nbsp;<strong>3</strong></p> \n<p>Contact the vendor and then&nbsp;download/use/instantiate&nbsp;<strong>2</strong></p> \n<p>Contact the vendor and&nbsp;get it mailed to them or&nbsp;Asset must be installed by the vendor&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p> \n<p><strong>Note 1: public repository can be Internet, NIPR, SIPR, or JWICS.</strong></p> \n<p><strong>Note 2: applicable to enterprise services as well as downloadable assets</strong></p>","evaluationSectionDescription":"Accessible"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.198Z","createUser":"rex.nethercott","updateDts":"2017-09-26T20:26:35.288Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"890c848e-8101-44a6-bbe0-2fd93834f6d4","response":"<p>Fully buildable source via a public repository or download site (e.g., GitHub)&nbsp;<strong>5</strong></p> \n<p>Github:</p> \n<p><a href=\"https://github.com/apache/apex-core\" rel=\"nofollow\">https://github.com/apache/apex-core</a></p> \n<p><a href=\"https://github.com/apache/apex-malhar\" rel=\"nofollow\">https://github.com/apache/apex-malhar</a></p> \n<p><a href=\"https://github.com/apache/apex-site\" rel=\"nofollow\">https://github.com/apache/apex-site</a></p> \n<p>&nbsp;</p> \n<p>Website Proper:</p> \n<p><a href=\"https://apex.apache.org/downloads.html\" rel=\"nofollow\">https://apex.apache.org/downloads.html</a></p> \n<p>&nbsp;</p>","responseId":"8577f675-2eba-4b92-b632-b4fd7b5dcf7c","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:37:58.686Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:37:58.686Z","updateUser":"devin.shurtleff","evaluationSection":"ACC","narrative":"<p>This question applies to re-deployable assets, and&nbsp;is intended to expose any burdens or obstacles that are in the way of a developer being able to download source code for an asset to re-use. It is also intended to see if source code is even allowed to be acquired and used for the asset.</p> \n<p>Examples of burdens that exist that need to be exposed include the following:</p> \n<ol> \n <li>Developer needs a CAC card.&nbsp; Although DoD and IC PKI (e.g., CAC cards, SIPR tokens, etc.) provide &nbsp;analysts and \"end users\" accessibility to DoD and IC operational systems,&nbsp;it actually hinders those (such as developers) who cannot get those DoD and IC&nbsp;PKI credentials.&nbsp; Therefore, requiring a CAC card (or similar DoD/IC PKI credential)&nbsp;to access binaries and source code is tantamount to&nbsp;severely limiting the user base that can access that asset.</li> \n <li>Developer needs a special account - AND - the account provisioning process is not set up&nbsp;for external members to request or get accounts.&nbsp; In other&nbsp;words, if&nbsp;someone wants to access the binaries or source code for an asset and needs an account to do&nbsp;so, but is unable to&nbsp;get that account because there are no instructions provided (or for other&nbsp;reasons can't get an account), then the asset is not re-usable.</li> \n <li>For COTS products, the developer needs to work with the vendor to get special access to a vendor FTP site</li> \n</ol> \n<p>&nbsp;</p> \n<p>If further questions or clarification is needed please comment below.</p>","objective":"<p>This question is about whether the asset's buildable source code is available to consumers. \"Available\" presupposes that the source code is accessible, well-organized and documented, facilitates building binaries on a consumer's own platform, and lends itself to code review and analysis.</p> \n<p>Some COTS vendors work in this open source model, while others do not.</p>","qid":"40","question":"<p>How do you make the source code available for 3rd parties?</p> \n<p>If available, please provide a link to the repository where the source code is stored, or other details on how to access and build it.</p>","questionId":"890c848e-8101-44a6-bbe0-2fd93834f6d4","scoreCriteria":"<p>Fully buildable source via a public repository or download site (e.g., GitHub)&nbsp;<strong>5</strong></p> \n<p>Fully buildable source via&nbsp;a private repository or download site (e.g., need to pre-register)&nbsp;<strong>4</strong></p> \n<p>Fully buildable source via&nbsp;mail (e.g., CD media)&nbsp;<strong>3&nbsp;</strong></p> \n<p>Source code is available, but not buildable&nbsp;<strong>2</strong></p> \n<p>Source code is not available for 3rd parties&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p> \n<p><strong>Note 1: \"Buildable\" means that everything needed to compile and build the source into an application is provided - either via POM files and MAVEN, or some other means.</strong></p>","evaluationSectionDescription":"Accessible"},"workflowStatusDescription":"Complete"},{"storageVersion":"4","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.2Z","createUser":"rex.nethercott","updateDts":"2017-09-27T18:34:51.812Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"484c4099-0b56-4799-a245-e74a82aa1388","response":"<p>&nbsp;</p> \n<div class=\"table-wrap\">\n  Documentation is easily accessible&nbsp;&nbsp; \n <strong>+1</strong> \n</div> \n<p>Tutorials and examples are provided&nbsp;<strong>+1</strong></p> \n<p>Internal architecture is explained&nbsp;<strong>+1 This is not very applicable because this is a framework for working with Hadoop, Yarn, and Kafka. The point will remain.</strong></p> \n<p><strong>&nbsp; &nbsp; &nbsp;&nbsp;</strong></p> \n<p>Software is documented sufficiently for a 3rd party to extend or fix bugs&nbsp;<strong>+1 Yes this asset is made to be customized.</strong></p> \n<p>How to integrate with the asset is explained&nbsp;<strong>+1</strong></p> \n<p>How to \"use\" the asset is explained&nbsp;<strong>+1</strong></p> \n<p>How to install and administer the asset is explained&nbsp;<strong>+1</strong></p> \n<p>The documentation is current for the version of the asset&nbsp;<strong>+1</strong></p> \n<p>Documentation is complete&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p>Full Score is awarded due to extensive documentation and examples of how to leverage the asset.</p> \n<p>Documentation Location:</p> \n<p><a href=\"https://apex.apache.org/docs.html\" rel=\"nofollow\">https://apex.apache.org/docs.html</a></p> \n<p>&nbsp;</p>","responseId":"b6a8276c-2f8d-42f2-9bba-616b1123c68f","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:41:31.083Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:41:31.083Z","updateUser":"devin.shurtleff","evaluationSection":"DOC","narrative":"<p>What this question is getting at is whether the appropriate documentation, in whatever form, can also be found and accessed by the potential consumer of the asset.&nbsp; Re-usable assets generally require documentation of various sorts in order for a potential consumer to be able to reuse that asset.&nbsp; Examples of such documentation might be architecture guidance that describe the internal architecture of the asset (especially important for GOSS or FOSS assets), system administrator guidance that aid system admins in installing or configuring the asset, developer guidance that describe to a developer how they would invoke or integrate with the asset, user guidance for those assets that are end-user oriented, etc.&nbsp; This documentation may or may not be in the form of \"documents\". It might be in the form of a wiki, or web pages accessible to consumers, packaged with the asset as documents, etc.</p> \n<p>It is worth noting that, at the point of asking this question, the potential consumer has already discovered and accessed the asset itself.&nbsp; What this question is getting at is whether the appropriate documentation, in whatever form, can also be found and accessed by the potential consumer of the asset.&nbsp;&nbsp;</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS assets.</p> \n<p>If further questions or clarification is needed please use the comment below.&nbsp;</p>","objective":"<p>Documentation in any form is important so that a consumer can understand the asset:&nbsp; what it does, how to use it, how to integrate with it, how to test it, etc. Both potential and actual consumers of the asset will be interested in this documentation.</p> \n<p>For COTS products, some vendors require license agreements or some form of agreement prior to sharing all the documentation. A limited set may be available prior to that.&nbsp;</p>","qid":"50","question":"<p><span>How well is the asset Documented?</span></p> \n<p><span>Please provide links to&nbsp;</span><span>the following documentation for your asset (note, multiple of the categories below may be provided in the same document):</span></p> \n<p>Software Architecture</p> \n<p>Developer's guide</p> \n<p>Integrator's guide</p> \n<p>User's guide</p> \n<p>Tester's guide/plans</p> \n<p>Test data</p> \n<p>Administrator's guide</p> \n<p>Security Accreditation</p> \n<p>Other documentation (e.g., tutorials, etc)</p> \n<p>If documentation is not accessible via the Internet, please provide the actual documentation</p>","questionId":"484c4099-0b56-4799-a245-e74a82aa1388","scoreCriteria":"<div class=\"table-wrap\">\n  Documentation is easily accessible&nbsp; \n <strong>+1</strong> \n</div> \n<p>Documentation is clear, with limited to no jargon or domain specific vocabulary&nbsp;<strong>+1</strong></p> \n<p>Tutorials and examples are provided&nbsp;<strong>+1</strong></p> \n<p>Internal architecture is explained&nbsp;<strong>+1</strong></p> \n<p>Software is documented sufficiently for a 3rd party to extend or fix bugs&nbsp;<strong>+1</strong></p> \n<p>How to integrate with the asset is explained&nbsp;<strong>+1</strong></p> \n<p>How to \"use\" the asset is explained&nbsp;<strong>+1</strong></p> \n<p>How to install and administer the asset is explained&nbsp;<strong>+1</strong></p> \n<p>The documentation is current for the version of the asset&nbsp;<strong>+1</strong></p> \n<p>Documentation is complete&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p><strong><strong>Add the numbers to the right of each item above and map to the below to get the score:</strong></strong></p> \n<p><strong>5</strong>&nbsp;= 9 or 10 points<br><strong>4</strong>&nbsp;= 7 or 8 points<br><strong>3</strong>&nbsp;= 6 points<br><strong>2</strong>&nbsp;= 4 or 5 points<br><strong>1</strong>&nbsp;= 3 or less points</p>","evaluationSectionDescription":"Documentation"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.201Z","createUser":"rex.nethercott","updateDts":"2017-10-03T15:32:57.378Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"e539f78a-7323-4724-b0f8-15cb14c7d9b2","response":"<p>All dependencies meet the dependency criteria (see below)&nbsp;<strong>5</strong></p> \n<p><strong>Dependencies :</strong></p> \n<p><strong>Git</strong></p> \n<p><strong>Maven</strong></p> \n<p><strong>Java</strong></p>","responseId":"4c8ebd8b-5b2b-4090-9660-55ce0c6338f0","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:42:50.521Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:42:50.521Z","updateUser":"devin.shurtleff","evaluationSection":"DEP","narrative":"<p>When an asset is made available for re-use, sometimes it requires other \"things\" to be in place in order for it to function.&nbsp; For example, if a redeployable capability (e.g., a WebApp) is packaged for re-use as a .war file, then it requires a JEE container (aka app server) in order to execute.&nbsp; With today's programming techniques and patterns, this is to be expected.&nbsp; However, sometimes when such an application is created, it leverages functions from the container that are proprietary to the particular container product.&nbsp; For example, a WebApp might leverage functions that are proprietary to, say, a WebLogic app server.&nbsp; In this case, you cannot reuse the component unless you also purchase and install, specifically, a WebLogic container.&nbsp; That still may not be all, though, as you may have to install a specific version of the WebLogic container.&nbsp;</p> \n<p>Additional examples of dependencies include the following:</p> \n<ul> \n <li>A back-end database.&nbsp; In this case, the dependency may be on any JDBC or ODBC conformant relational database, or on a specific database product - such as SQL server or Oracle, or Mongo or Accumulo, etc. &nbsp;</li> \n <li>A back-end server component.&nbsp; For example, a map widget might be dependent upon Ozone Widget Framework as well as an&nbsp;<a href=\"http://www.opengeospatial.org/\" rel=\"nofollow\">OGC&nbsp;</a><a href=\"http://www.opengeospatial.org/standards/wms\" rel=\"nofollow\">Web Map Service</a>.</li> \n <li>A specific operating system (e.g., Linux, Windows, etc.)&nbsp;</li> \n <li>A specific hardware configuration (e.g., x86, Solaris, etc.)</li> \n <li>An entire system (i.e., the asset cannot be extracted from the larger system it is part of)</li> \n</ul> \n<p>The number and type of dependencies required to re-use a component is an important consideration in whether a component can be easily re-used or not.&nbsp; For example, if&nbsp;an asset requires the purchase of Oracle middleware (app server and database) in order to run, and that program has no extra money for additional software licenses but they have already purchased Oracle middleware for other reasons, than that dependency is reasonable for that particular program.&nbsp; However, if the program has not already purchased the Oracle middleware licenses, then the dependency on such middleware components can preclude that program from re-using that particular asset.&nbsp;</p> \n<p>In general, the less dependencies, and the more generic any given dependency, the better.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p>","objective":"<p>Identify what other \"things\" are required to be in place in order for the asset to function.&nbsp; Common examples include application containers, databases, Enterprise Service Buses (ESB), etc.</p>","qid":"60","question":"<p>Please list all dependencies&nbsp;required in order for your asset to be installed, and whether they are configurable?</p> \n<p>Please also identify the following:</p> \n<p>Whether the dependency is generic (e.g., \"any JEE application server\") or specific (e.g., \"requires version x.y of WebLogic\").</p> \n<p>Whether the dependency is pre-packaged with the asset (e.g., included in the installer)</p> \n<p><span>If your asset has a built-in data persistence mechanism</span>&nbsp;(e.g., database, flat files, etc.) please identify what that mechanism is.</p>","questionId":"e539f78a-7323-4724-b0f8-15cb14c7d9b2","scoreCriteria":"<p>Asset has no dependencies&nbsp;<strong>5</strong></p> \n<p>All dependencies meet the dependency criteria (see below)&nbsp;<strong>5</strong></p> \n<p><strong>One</strong>&nbsp;dependency violates&nbsp;<strong>one</strong>&nbsp;of the dependency criteria&nbsp;<strong>3</strong></p> \n<p>More than one dependency violates more than one of the dependency criteria&nbsp;<strong>1</strong></p> \n<p>Dependency Criteria:</p> \n<ul> \n <li>Dependencies are well documented</li> \n <li>Dependencies&nbsp;can include any version of the dependency after (and including) the previous major release</li> \n <li>Dependencies&nbsp;do not&nbsp;<strong>require</strong>&nbsp;licenses or paid subscription (e.g., can be substituted with non-licensed versions)</li> \n</ul> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Deployable"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.203Z","createUser":"rex.nethercott","updateDts":"2017-10-04T18:17:59.34Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"1992800f-bc76-4d1c-9c85-f65c1c452d4a","response":"<p>There are multiple ways to instantiate and use this asset.&nbsp;</p> \n<p>1. It can be used with a VM&nbsp;<a href=\"https://www.datatorrent.com/download/\" rel=\"nofollow\">https://www.datatorrent.com/download/</a></p> \n<p>2. It can be used with Docker&nbsp;<a href=\"https://hub.docker.com/r/apacheapex/sandbox/\" rel=\"nofollow\">https://hub.docker.com/r/apacheapex/sandbox/</a></p> \n<p>&nbsp;</p>","responseId":"6f9bc2a0-b7ed-44bb-8b94-98af4ee892b5","score":3,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:43:46.152Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:43:46.152Z","updateUser":"devin.shurtleff","evaluationSection":"DEP","narrative":"<p>This question is getting at how easy the software or web service is to install. If an asset is packaged and performs self-installation this is ideal as the user will takes less time to be up and running. &nbsp;Needing to work through a long install process has a greater chance for failure and misunderstandings.&nbsp;</p> \n<p>&nbsp;</p> \n<p>Please leave a comment below if there are further questions or clarification needed.&nbsp;</p>","objective":"<p>Describe how the asset is packaged in order to understand better how it would be re-deployed in another environment.&nbsp; Examples of packaging are .war files, MSI installer, etc.</p>","qid":"62","question":"<p>How is the asset packaged for deployment/installation?</p> \n<ol> \n <li>Installer provided for all platforms&nbsp;(e.g., MSI for Windows or RPM for Linux)</li> \n <li>Installer provided for only one platform</li> \n <li>Virtual machine image</li> \n <li>Binaries in archive file (e.g., .zip or .tar)</li> \n <li>Source code only - binaries need to be built by consumer</li> \n <li>Other.&nbsp; Please specify.</li> \n</ol>","questionId":"1992800f-bc76-4d1c-9c85-f65c1c452d4a","scoreCriteria":"<p>Installer provided for all platforms&nbsp;(e.g., MSI for Windows or RPM for Linux) or as a Docker Image&nbsp;<strong>5</strong></p> \n<p>Installer provided for only one platform&nbsp;<strong>4</strong></p> \n<p>Virtual Machine Image only<strong>&nbsp;3</strong></p> \n<p>Binaries in archive file (e.g., .zip or .tar)&nbsp;<strong>2</strong></p> \n<p>Source code only - binaries need to be built by consumer&nbsp;<strong>1</strong></p> \n<ul> \n <li></li> \n</ul> \n<p><strong><strong>The number to the right of each item above is the score</strong></strong></p>","evaluationSectionDescription":"Deployable"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.204Z","createUser":"rex.nethercott","updateDts":"2017-10-03T15:34:07.953Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"1f77df21-a8b9-445b-b24b-a11d12566063","response":"<p>All major platforms&nbsp;<strong>5</strong></p>","responseId":"ca80681a-bfae-44bb-aff8-26310bf276e6","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:51:28.579Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:51:28.579Z","updateUser":"devin.shurtleff","evaluationSection":"DEP","narrative":"<p>This question is getting at widely reusable the asset is. If an asset is developed and packaged to run on multiple platforms, it is more widely and easily reused.&nbsp;In other words, can the developer \"install\" or otherwise re-use the asset with minimal effort (i.e., a developer can download and install it with a minimal of steps).&nbsp; Sometimes assets are available for re-use, but packaged in such a way as to make it more difficult for the developer to employ in their particular environment.&nbsp;</p> \n<p>&nbsp;</p> \n<p>Please leave a comment below if there are further questions or clarification needed.&nbsp;</p>","objective":"<p>Describe the environments or platforms the asset can be reused on.</p>","qid":"65","question":"<p><span>How many platforms is the asset packaged for?</span></p> \n<ol> \n <li>Single (1) platform (e.g., Windows only)</li> \n <li>Two (2) or more (e.g., Windows and Linux)</li> \n <li>All major platforms (e.g., Windows, Linux, Unix, MacOS)</li> \n</ol> \n<p>Please list all platforms supported</p>","questionId":"1f77df21-a8b9-445b-b24b-a11d12566063","scoreCriteria":"<p>All major platforms&nbsp;<strong>5</strong></p> \n<p>Two (2) or more widely used platforms&nbsp;<strong>4</strong></p> \n<p>Single (1) widely used platform<strong>&nbsp;3</strong></p> \n<p>Older (but not yet deprecated) versions of one or more widely used platforms<strong>&nbsp;2</strong></p> \n<p>Specialty or deprecated platform only (e.g., Solaris)&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Deployable"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.205Z","createUser":"rex.nethercott","updateDts":"2017-10-11T20:54:55.594Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"0e447648-d577-4134-90d4-7cd091b6d695","response":"<p>It is not feasible to test all of the asset's features, but some of the&nbsp;features that have been tested work as expected.</p>","responseId":"2a1fb65b-fa6a-429e-aeed-f0dcc932cf81","score":4,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T14:54:02.702Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T14:54:02.702Z","updateUser":"devin.shurtleff","evaluationSection":"USAB","narrative":"<p>This question looks to see whether an asset is \"usable\" in the general sense, that is,&nbsp;the functionality and features of the asset as contained in the asset's publicly discoverable capability descriptions are fully implemented and available in the current release package. The intention is not to conduct a formal IV&amp;V on whether the asset satisfies all of its functional requirements, but rather a high level check to make sure an ordinary user will not be surprised to find promised functionality missing. Unavailable and planned features should clearly marked as such in both the UI and documentation.</p> \n<p>In addition to checking the asset's discovery metadata and its documentation package, to fully answer the question usually requires downloading and installing the asset (in the case of a widget,a &nbsp;web service, or other redeployable component) or accessing its endpoint (in the case of an enterprise service), and exercising some use case scenarios (i.e., \"happy path\" test cases). If it is not feasible to do so, an alternative would be to interview current users or evaluate any existing test documentation to ensure that functionality was tested.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS. &nbsp;Although it is expected that COTS will score highly on this question, it is not guaranteed to be so as many COTS products market themselves as more feature complete than they actually are.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: All promised features are fully implemented and functional in current implementation.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: Some minor features as described in discovery metadata missing or under development; they are clearly marked as such in both UI and documentation.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: Major features as described in discovery metadata are missing or not fully implemented in current implementation, not yet \"ready for prime time\".</p>","objective":"<p>Differentiate asset features that are fully implemented, partially implemented, or not yet implemented. This is to avoid surprises by the purchaser. If marketed features are not yet available (or are only partially available) they should be clearly marked as such in both the UI (if applicable) and the documentation.</p>","qid":"70","question":"<p>Please identify which of your asset's features are either only partially implemented, or are not implemented but are planned for a future release?</p>","questionId":"0e447648-d577-4134-90d4-7cd091b6d695","scoreCriteria":"<p>All marketed features are fully implemented (i.e., implemented according to the marketing literature and/or consistent with \"best-of-breed\")&nbsp;<strong>5</strong></p> \n<p>One marketed feature is only partially implemented (i.e., marketing literature implies more functionality than is actually implemented)&nbsp;<strong>3</strong></p> \n<p>More than one marketed feature is only partially implemented - OR - one marketed feature is not implemented at all (or is otherwise not usable)&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Usable"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.207Z","createUser":"rex.nethercott","updateDts":"2017-10-03T14:19:32.298Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"0335c684-3856-4511-bb3d-f98d9f25e7bb","response":"<p><span>Asset is designed for the expert user. A casual user cannot use the system without prior training.</span></p> \n<p>A score of 4 is given even though there is a high learning curve. This is a measure of the effort put in by the developers to make their product accessible and easy to learn.</p>","responseId":"543d6766-d604-4241-a222-9deb56ffd2e4","score":4,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:28:49.93Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:28:49.93Z","updateUser":"devin.shurtleff","evaluationSection":"USAB","narrative":"<p>The intent of this question is on the&nbsp;<em>intuitiveness</em>&nbsp;of the design, i.e.&nbsp;can a user use the system without seeking external help (e.g. training or documentation)? Note that the intuitiveness may also depend on the efficiency level of the user: an expert user, for example, may want shortcuts or customized sequences tailored to his/her tasks, which may not be as intuitive to a novice user. The UI platform also play an important role: Intuitive controls in a desktop-based web browser (e.g. right-clicks or control-key sequences), for instance, may not be suitable for mobile devices.</p> \n<p>The definition of a UI design's \"goodness\" may be difficult to come by, but oftentimes \"you know it when you see it\". In other words, although the criteria of a good UI design is somewhat subjective, there are well-established (albeit sometimes tacit) guidelines and best practices that people follow.</p> \n<p>A good user interface (UI) design is important in boosting a user's productivity and efficiency in completing tasks and ensuring operational success. For a newly developed component or system, it is also critical in gaining user acceptance.&nbsp;ISO 9241-11 suggests that measures of usability should cover</p> \n<ul> \n <li>effectiveness ( the ability of users to complete tasks using the system, and the quality of the output of those tasks),</li> \n <li>efficiency ( the level of resource consumed in performing tasks)</li> \n <li>satisfaction (users’ subjective reactions to using the system).</li> \n</ul> \n<p>To score high in this question, the UI component should ideally possess the following characteristics:</p> \n<ul> \n <li>Intuitive controls suitable for the specific UI platform (e.g. desktop thick clients, browser-based thin clients, mobile/handheld devices, embedded instrument panels, etc.)</li> \n <li>Easy-to-follow navigation controls and error preventions tailored to the usage context (e.g. bread crumbs, greying out non-applicable inputs, etc.)</li> \n <li>Tailored controls based on user proficiency levels and/or operator communities</li> \n <li>Positive feedback from real user experience</li> \n</ul> \n<p>A lack thereof would result in a low score.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS. &nbsp;Although one would expect COTS&nbsp;products to score highly for this question, it is not guaranteed to be so. &nbsp;Some COTS products can have very complex and difficult to understand UIs.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: Intuitive UI controls exist for user navigation, error prevention etc., for the target platform&nbsp;<span style=\"text-decoration: underline;\">(e.g., desktop, mobile devices, servers)</span>; a casual / novice user can use the system without prior training or documentation</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: Limited UI controls (such as navigation and error prevention) exist for guiding a user, but may require training and documentation for using advanced features of the component</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: UI design not intuitive; a casual user cannot use the system without prior training</p>","objective":"<p>Ascertain the&nbsp;<em>intuitiveness</em>&nbsp;of the design. Can a user use the system without seeking external help (e.g. training or documentation)? This is generally enabled by following well-known patterns, conventions (e.g. command shortcuts, undo/redo) and standards that the typical end user is already familiar with, and which take advantage of human factors studies to help ensure easy to use and intuitive design.</p> \n<p>Some UIs are intentionally targeted for the expert user, who may want shortcuts or customized sequences tailored to expert tasks, and as a result may not be as intuitive to a novice user.</p>","qid":"80","question":"<p>How much training does the typical user require before they can master your asset's features?</p> \n<ul> \n <li><span>Asset is very Intuitive - a casual / novice user can use the system without prior training or documentation</span></li> \n <li><span>Asset may require training and documentation , but only for using advanced features of the component</span></li> \n <li><span>Asset is designed for the expert user. A casual user cannot use the system without prior training</span></li> \n <li><span>Not Applicable - no end-user interface for this asset</span></li> \n</ul>","questionId":"0335c684-3856-4511-bb3d-f98d9f25e7bb","scoreCriteria":"<p>Testers were able to fully leverage the asset without referring to the manual or help pages&nbsp;<strong>5</strong></p> \n<p>Testers needed to refer to the manual/help pages for only one specific part of the asset&nbsp;<strong>4</strong></p> \n<p>Testers needed to refer to the manual/help pages for two or three specific parts of the asset&nbsp;<strong>3</strong></p> \n<p>Testers needed to regularly refer to the manual/help pages in order to use the asset&nbsp;<strong>2</strong></p> \n<p>Testers could not successfully use the asset without reaching out to the product owner or going through specialized training&nbsp;<strong>1</strong></p> \n<p>Not Applicable - no end-user interface for this asset<strong><br></strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Usable"},"workflowStatusDescription":"Complete"},{"storageVersion":"4","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.208Z","createUser":"rex.nethercott","updateDts":"2017-10-25T13:54:19.584Z","updateUser":"stan.burlingame","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"76b4c7d6-8924-45b0-8266-5b1a19d2914e","response":"<p>Information regarding error messages is not documented. Nor is is expected.</p>","responseId":"c6c44c08-74e1-4269-a41a-fd5a09557e5d","score":1,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:31:16.65Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:31:16.65Z","updateUser":"devin.shurtleff","evaluationSection":"ERR","narrative":"<p><span style=\"text-decoration: underline;\"><strong><span style=\"text-decoration: underline;\">Question</span>:</strong></span>&nbsp;Do errors get conveyed to the consumer (end user or consuming application) in a meaningful manner?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: Error messages should be presented to consumers (whether end user in the case of widgets, or consuming applications in the case of enterprise services or APIs from redeployable capabilities) in a way that is informative, easy to understand, and (when possible) actionable by providing helpful information on alternatives/mitigations/resolutions (i.e., is an error message that gives reasonable information they could be conveyed to a sys admin or help desk). This question is not specific to user-facing components such as web pages and widgets. Even machine-to-machine services and backend components should try to provide meaningful error messages that can eventually help the end user understand the reason of the error.</p> \n<p>In general, \"raw\" error messages (e.g. Java stack traces, HTTP error codes, Apache Tomcat out-of-the-box error page, etc.) should never just be passed directly on to the consumer.&nbsp; Instead, they should be \"wrapped\" when logged (see question Q390) and an actionable and informative human-understandable message relayed either directly to the end user in the case of widgets, or to a consuming application in the case of an enterprise service.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS. &nbsp;For COTS or GOTS where source code is not provided, answering this question will require looking a documentation of error codes and logging, as well as invoking the error handling and reading the logs and returned error codes.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>:&nbsp; Meaningful error messages are conveyed with helpful information on error resolution (e.g. wait for certain time period; contact system admin or helpdesk).</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: Meaningful error messages are conveyed but no helpful information is available for error resolution.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: \"Raw\" error messages (e.g. stack traces) are conveyed with no meaningful explanation,&nbsp;or error messages return no information (e.g., \"an error has occured\"), are extremely generic (e.g., \"Connection failed\"), or occur silently.</p> \n<p>Note to the evaluator: the answer to this question is best determined via a combination of code inspection, documentation, and actual performance testing that explicitly exercises the error handling.&nbsp; However, it is recognized that the evaluator may not have the resources to perform the testing that is required, in which case relying on test plans and results documentation from the component provider (assuming the test plans and results explicitly include error handling)&nbsp;and/or, in cases where source code is available, spot checking said code, is sufficient. &nbsp;Spot checking code involves searching the code for error messages and looking at a sample set of error messages.&nbsp;</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>: Can the root cause of errors be easily determined?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: This question is about whether assets can generate and communicate internal state information when an error occurs so that the root cause of the error can be determined by an authorized person (e.g., system administrator).&nbsp; In a component-based architecture, a user request is usually fulfilled by a set of interacting software components that may be individually developed and configured. This makes determining the root cause of an error more challenging compared with a tightly-coupled, \"stove-piped\" system. When evaluating a component-based software asset as a reuse candidate, a number of factors come into play with regard to its error handling ability:</p> \n<ul> \n <li><em>Basic enablers</em>&nbsp;to error diagnosis, i.e., the component's internal error logging and error escalation mechanisms. A well-designed component usually has the ability to wrap and propagate errors meaningfully while maintaining the error traces. For example, an EJB component may replace an SQL exception from a database query with a more meaningful error message to the UI layer. The original error is still logged and maintained for diagnosis purposes.&nbsp;</li> \n <li>The component's ability to support&nbsp;<em>integrated component-level monitoring</em>. A component may have multiple log files and correlating an error across files to determine the actual case can be very difficult. A well designed component will provide meaningful, correlated messages to aid in debugging. For example, debugging SSL errors can be very complicated due to many error messages spread across multiple error logs.&nbsp;</li> \n <li>The component's ability to integrate with external monitoring software via APIs, supporting&nbsp;<em>integrated software-level monitoring</em>.&nbsp;Although a component may have its own administration console for health and status monitoring, an administrator for a large-scale system may be burdened with having to monitor multiple component-level consoles at runtime, which quickly becomes labor intensive. A better option would be to send component-level metrics to a designated monitoring software, which can ingest, aggregate and visualize data in a consistent manner. The Java Management eXtension (JMX) API, for example, allow JEE components output their management information to the container.</li> \n <li>The component's ability to support&nbsp;<em>integrated&nbsp;system-level monitoring</em>. Software errors, esp. the critical ones, are often caused by underlying hardware failures (e.g. failure of a storage disk, a CPU, or a data communication line). For the overall system, software level error messages must be correlated with hardware-level monitoring to provide the end-to-end picture of system health. Pre-built integration plugins with system monitoring software (e.g. Nagios, HP OpenView, IBM Tuxedo), in particular can give a component the maximum ability for root cause analysis.</li> \n</ul> \n<p>When evaluating an asset's documentation, the evaluator should look for design and testing documentation on its error propagation design, its support of standard monitoring/management APIs, and its integration with existing software-level and/or system-level monitoring software. In the case when detailed technical documentation is not available, code reviews may offer additional insight.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS - though for COTS and GOTS where source code is not provided this question should be answered based on available documentation and via evaluating logs after forcing some error conditions.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>:&nbsp; Logging is well-coordinated across sub-components, both in common terminology and format, timestamps, etc., as well as in logging to a common file or coordinated files. Error messages in log files are meaningful and useful to log monitoring tools such as Splunk.&nbsp; \"System-level monitoring\": Integration interfaces (e.g., SNMP, JMX) may be provided for integration with a system management tool (e.g. HP OpenView, Nagios).</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>:&nbsp; Logging is somewhat coordinated across sub-components, either in common terminology and format, timestamps, etc., or in logging to a common file. Most error messages in log files are meaningful .\"Software-level monitoring\": Cascading errors are logged (e.g. through stack traces) so that the originating software component or module can be determined</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: Logging is not coordinated across sub-components (different sub-components log to different files and use differing message formats).&nbsp; Only high level error messages are logged with no meaningful debugging information provided. Unable to determine root cause of errors</p>","objective":"<p>Error messages are presented via the user interface to end users and via APIs to consuming applications, and should convey enough information so that the consumer (application or person) can work with a&nbsp;system administrator or help desk to resolve issues that might come up.</p> \n<p>Likewise, errors that are logged should provide enough information to help an authorized person (e.g., system administrator, developer) to determine the root cause of errors. This is generally made easier if errors are in either a single error file, or in error logs that can be coordinated across subcomponents (i.e.. common terminology and format, timestamps, etc).&nbsp;</p>","qid":"90","question":"<p><span>How well are the error messages documented?</span></p> \n<p>Please provide the documentation (can be via a link) that contains information on error&nbsp;messages&nbsp;(whether associated with APIs or UIs).</p> \n<p><span>Please also identify what error logs are generated by your asset</span></p>","questionId":"76b4c7d6-8924-45b0-8266-5b1a19d2914e","scoreCriteria":"<p>Error messages are well documented,&nbsp;presented, and understandable&nbsp;(either via self documentation, or separate documentation)&nbsp;<strong>5</strong></p> \n<p>Error&nbsp;messages&nbsp;are well documented, but a few errors require expertise to decipher&nbsp;<strong>4</strong></p> \n<p>Error&nbsp;messages&nbsp;are documented, but documentation requires expertise to fully understand, or some error&nbsp;messages&nbsp;are too generic to point to specific errors<strong>&nbsp;3</strong></p> \n<p>Error&nbsp;messages&nbsp;are not very well documented, and either require expertise to decipher or are too generic to be much use&nbsp;<strong>2</strong></p> \n<p>Error&nbsp;messages&nbsp;are not documented&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Error Handling"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.218Z","createUser":"rex.nethercott","updateDts":"2017-10-04T18:41:36.365Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"7113ba4b-7365-4c5a-abfe-6c001f5d38b1","response":"<p>Asset automatically restarts or resets to known good state&nbsp;<strong>3</strong></p>","responseId":"931bc46f-cba2-40c0-bc90-100953dab209","score":3,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:32:30.259Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:32:30.259Z","updateUser":"devin.shurtleff","evaluationSection":"ERR","narrative":"<p>This question focus on whether error handling is built into the asset.&nbsp; When an error occurs and is not captured and handled, it may result in an asset freezing, crashing, or otherwise ceasing to function, and then operator intervention to resume service - for example by stopping and re-starting the asset. In the worst cases, a crashed asset leaves various subcomponents in an indeterminate state (e.g., asset crashes in the middle of a multi-step process) so that when the asset is re-started there is no way to tell what step it was in and what steps had completed. Error handling can \"catch\" errors when they are generated and handle them appropriately.&nbsp; For example, if a serious error is generated by the operating system, the asset can catch that error and write its current state to a log file and close any open connections before shutting down.&nbsp; Robust error handling enhances the predictability and resiliency of the component, thereby making it a more desirable reuse target.&nbsp; Specifically, graceful error handling includes at least the following aspects:</p> \n<ul> \n <li>Exceptions / alternative user actions should be properly identified and handled, so that they don't cause the software component to become unresponsive or worse, go into an illegal state. Such user actions may include out-of-range input values (e.g. divide by zero), large volume of input/output data (e.g. uploading a big file), illegal configurations (e.g., using an unsupported browser or browser version), etc.</li> \n <li>Graceful degradation of performance when the component is under load/stress/failure. The load/stress/failure may be caused either by heavy user loads or underlying hardware/software failures such as a crash of an internal database or an outage of an application server instance under a clustered configuration.&nbsp; Avoiding total system crash and allowing at least partial system functionality in this case requires careful planning and design in advance, and is usually harder to achieve than handling functional exceptions.</li> \n</ul> \n<p>To score high in this question, the component provider would have ensured that exceptions are caught at all places where they can occur and are properly handled.&nbsp; Additionally, such exception handling is exercised in testing (with resulting test cases and results provided for review).&nbsp; Note that exception handling should also consider load conditions to ensure that the asset degraded gracefully under such load vice getting into indeterminate state or stopping altogether.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS. &nbsp;However, for those COTS or GOTS assets where source code is not provided, the only ways to validate this question are to look at documentation for error codes and logging, as well as to actually test the asset with invalid parameters in order to invoke the error handling code.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: The asset gracefully handles errors and remains stable under most operating conditions.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: The asset handles some errors and often remains stable.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: The asset requires frequent operator or user intervention to continue working.</p> \n<p>&nbsp;</p> \n<p>Note to the evaluator: the answer to this question best determined via a combination of code inspection, documentation, and actual performance testing that explicitly exercises the error handling.&nbsp; However, it is recognized that the evaluator may not have the resources to perform the testing that is required, in which case relying on test plans and results documentation from the component provider is sufficient (assuming the test plans and results explicitly include error handling).&nbsp;</p>","objective":"","qid":"100","question":"<p>How well does the asset recover from errors?</p> \n<p>Please identify how your asset recovers from errors or degraded service.</p>","questionId":"7113ba4b-7365-4c5a-abfe-6c001f5d38b1","scoreCriteria":"<p>Errors are handled gracefully and don’t put the data or application in a bad state&nbsp;<strong>5</strong></p> \n<p>Asset automatically restarts or resets to known good state&nbsp;<strong>3</strong></p> \n<p>User or Administrators are notified and manual restart required&nbsp;<strong>2</strong></p> \n<p>&nbsp;</p> \n<p>User or Administrators are NOT notified and manual restart required&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Error Handling"},"workflowStatusDescription":"Complete"},{"storageVersion":"4","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.219Z","createUser":"rex.nethercott","updateDts":"2017-10-11T20:57:31.255Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"40fe0fba-ce12-49f1-b2d8-354d05c78797","response":"<p>Not applicable. This is something that is built rather than something that is implemented or called.</p>","responseId":"b74d74d5-edb0-42b2-ab0d-dfa4278ce0bf","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:37:37.092Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:37:37.092Z","updateUser":"devin.shurtleff","evaluationSection":"INT","narrative":"<p>This question is getting at how well the service API is designed.&nbsp; A good API is intuitive and follows good design principles - and in particular it is designed from the perspective of the developer who has to invoke the API (as opposed to the developer who just leverages some automated tools to expose existing functionality).&nbsp; For SOAP calls, this includes the following: the naming convention and actual names of the methods, arguments, and the URLs to the endpoints, whether HTTP verbs are used appropriately, whether the naming of the methods and arguments is consistent with the functionality exposed</p> \n<p>Another way to understand what we are looking for in this questions is how easy it is for a developer to be able to understand, and write code to invoke, the API of the service.&nbsp; It is important to note here that there is some ambiguity as to what people generally mean by the term \"service\". Some folks equate \"service\" with a specific API call (\"operation\" or \"method\"), for example, an API that contains 4 calls would be considered as 4 \"services\".&nbsp; On the other hand, some equate \"service\" with something more abstract that can be accessed by API calls, for example, a single service API might provide 4 calls to access the one service's functionality.&nbsp; This question considers service in the latter case, and in general, from the perspective of a human developer who has to design and code a consuming application, the latter case is more meaningful, and the API to the service should be designed with this human developer in mind.&nbsp;</p> \n<p>Too often, APIs to services are designed and implemented only considering the effort required for the&nbsp;<strong><em>service&nbsp;</em></strong><strong><em>developer,&nbsp;</em></strong>and not considering the effort required of the&nbsp;<em><strong>consuming developer</strong></em>.&nbsp; For SOAP services, this often manifests in developers using a tool like Java2WSDL to auto-generate SOAP operations and arguments from existing Java classes. resulting in interfaces and WSDL description documents that are cryptic (i.e., hard for a developer to understand) and that map Java class methods directly to SOAP operations. &nbsp; This can be somewhat mitigated if the Java class being exposed was specifically implemented as an interface class and designed to be easy to understand and invoke, but even in these cases the method arguments still tend to be cryptic.&nbsp; If a service provider wants to leverage Java2WSDL, they can do so as a starting point, but then will need to manually adjust the resulting WSDL to be more \"developer friendly\" in terms of argument names and added comments.&nbsp; In the case of RESTful web services, the focus on ease of implementation for the service developer manifests as poorly organized web resources and not using the HTTP verbs, error codes, caching MIME types and hypermedia correctly.</p> \n<p>In order to score highly in this question, the API calls associated with a service:</p> \n<ol> \n <li>should be easily understood as to the specific parts of the service functionality they invoke along with any necessary ordering of those methods,</li> \n <li>should use current web protocols (e.g., JSON over HTTP) and use them correctly (e.g., appropriate HTTP verbs, error codes, caching, MIME types and hypermedia, i.e., passing links to other service endpoints in the response).&nbsp;</li> \n <li>should come with provided examples of how to invoke the API calls, expected responses, and allowable error codes, along with the API definition.&nbsp;</li> \n <li>should use plain english terms for method (operation) and argument names</li> \n <li>should be as generic as possible (e.g., method call should be more generic, with specificity captured in the document passed in (in the case of SOAP calls), or the URI path</li> \n <li>should not require any proprietary client side modules in order to access the service</li> \n</ol> \n<p>Note that this question somewhat overlaps with question 200, but is more specifically focused on the ease of invocation.</p> \n<p>Note that applying the RESTful paradigm in terms of organization of functionality and URL naming are a part of making the API calls more understandable.&nbsp; This applies even when using SOAP, since SOAP service endpoints are identified by URLs.&nbsp; There are numerous examples of how to organize web resources to be scalable and how to name them to be understandable (e.g., resources = nouns).&nbsp;</p> \n<p>The bottom line is that when a developer who is not familiar with the service can, just by looking at the API, understand how to invoke the service, and that the API itself leverages appropriate web protocols and paradigms, the service is much easier to invoke.</p> \n<p>A good primer on how to design good APIs is included in \"pragmatic RESTful principles\" such as those defined in&nbsp;<a href=\"http://www.vinaysahni.com/best-practices-for-a-pragmatic-restful-api\" rel=\"nofollow\">http://www.vinaysahni.com/best-practices-for-a-pragmatic-restful-api</a></p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: API follows all 6 of the \"shoulds\" identified above</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: API follows at least 3 of the \"shoulds\" identified above</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: API follows none of the \"shoulds\" identified above</p>","objective":"<p>In order to be \"easily invoked\", API calls associated with the asset should:</p> \n<ol> \n <li>Be easily understood as to the specific parts of the asset functionality they invoke along with any necessary ordering of those methods,</li> \n <li>Use modern protocols appropriate to the kind of asset (e.g., JSON over HTTP) and use them correctly (e.g., appropriate HTTP verbs, error codes, caching, MIME types and hypermedia, i.e., passing links to other service endpoints in the response).&nbsp;</li> \n <li>Come with provided examples of how to invoke the API calls, expected responses, and allowable error codes, along with the API definition.&nbsp;</li> \n <li>Use plain English terms for method (operation) and argument names \n  <ol> \n   <li>be as generic as possible (e.g., method call should be more generic, with specificity captured in the document passed in (in the case of SOAP calls), or the URI path</li> \n  </ol> </li> \n <li>Document any ordering or temporal dependencies across the API calls \n  <ol> \n   <li>E.g., invoke the \"add to the cart\" API call at least once before invoking the \"calculate payment\" API call</li> \n  </ol> </li> \n <li> <p>Not require any proprietary client side modules in order to access the asset</p> \n  <ol> \n   <li>Note that client-side modules can be supplied (e.g., javascript clients, agents, etc.), but they should be optional</li> \n  </ol> </li> \n</ol>","qid":"110","question":"<p>Are the APIs well defined and documented?</p> \n<p>For each API or External Interface in your asset, please provide documentation that addresses&nbsp;the following items. If documentation is not available, please provide answers directly:</p> \n<ul> \n <li>The specific functionality each individual API invokes</li> \n <li>The transport and encoding protocol(s) each individual API uses (e.g., JSON over HTTP)&nbsp;</li> \n <li>Examples of invoking each API</li> \n <li>Arguments, HTTP Query parameters, and/or schemas (as applicable) associated with each API</li> \n <li>Any necessary ordering of API calls \n  <ul> \n   <li>E.g., invoke x before you invoke y</li> \n  </ul> </li> \n <li>What, if any, specific client-side modules or plugins are required</li> \n</ul> \n<p>&nbsp;</p>","questionId":"40fe0fba-ce12-49f1-b2d8-354d05c78797","scoreCriteria":"<div class=\"table-wrap\">\n  API is clear as to specific functionality invoked on the asset \n</div> \n<p>API uses modern protocols and encoding specifications</p> \n<p>API examples and documentation are provided detailing&nbsp;the API definition,&nbsp;how to invoke the API calls, expected responses, and allowable error codes.</p> \n<p>Plain English terms are used for method (operation) and argument names</p> \n<p>Ordering or temporal dependencies across the API calls is documented</p> \n<p>No proprietary client side modules are required</p> \n<p>&nbsp;</p> \n<p><strong>5</strong>&nbsp;= 6 of 6 above<br><strong>4</strong>&nbsp;= 5 of 6 above&nbsp;<br><strong>3</strong>&nbsp;= 4 of 6 above<br><strong>2</strong>&nbsp;= 3 of 6 above<br><strong>1</strong>&nbsp;= 2 or less of 6 above<br><strong>N/A</strong>&nbsp;= no API&nbsp;</p>","evaluationSectionDescription":"Integrable"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.221Z","createUser":"rex.nethercott","updateDts":"2017-10-11T20:57:54.463Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"d52b65ef-a3b5-43d4-92b9-34a173eb9f03","response":"<p>Not applicable.&nbsp;This is something that is built rather than something that is implemented or called.</p>","responseId":"334968a1-3da0-4444-a3ae-34ecfbdc4fc8","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:41:16.353Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:41:16.353Z","updateUser":"devin.shurtleff","evaluationSection":"INT","narrative":"<p>The APIs of an asset may change over time. Since these changes directly impact the consuming applications, they need to be managed carefully. Note that the API changes may or may not coincide with implementation changes of the asset. Ideally, these changes should follow separate lifecycles and be governed separately.&nbsp;Asset back-end APIs, such as SOAP or RESTful interfaces, should follow design patterns and best practices that facilitate implementation-independence, information hiding, and endpoint versioning. Such patterns and best practices should include, at the minimum:</p> \n<ul> \n <li>Data formats are particularly important when designing for resilience to change. For many formats (e.g., XML) there are many design patterns that help to provide resilience (e.g., Russian Doll, Venetian Blind).&nbsp;</li> \n <li>Use of standards-based data transfer formats (such as&nbsp;SOAP, XML, JSON, KML, etc.), preferably over HTTP/S.</li> \n <li>Information hiding such that API methods and arguments do not encompass implementation-specific data (e.g. table names and column headers from the underlying database).</li> \n <li>Versioning of the API endpoints. For RESTful interfaces, the API should ideally include a versioning identifier as part of the overall URI/URL. For SOAP web services or other session-oriented protocols (e.g. CORBA/IIOP), the service interface should have discoverable metadata that include versioning attributes (e.g. in a service registry).</li> \n</ul> \n<p>Moreover, the asset&nbsp;provider should see communicate the API changes to consumers proactively and manage their expectations.</p> \n<p>Note that this also applies to web widgets. &nbsp;In the case of web widgets, the APIs should be managed in a way that backwards compatibility is maintained. &nbsp; For example, this can be done by making sure changes to JSON objects are done by either only adding new JSON elements to existing JSON objects, or when adding a new JSON object while still supporting the old one. &nbsp;</p> \n<p>Some very good guidance on designing resilient APIs is at&nbsp;<a href=\"https://mathieu.fenniak.net/stop-designing-fragile-web-apis/\" rel=\"nofollow\">https://mathieu.fenniak.net/stop-designing-fragile-web-apis/</a>&nbsp;and&nbsp;<a href=\"https://mathieu.fenniak.net/the-api-checklist/\" rel=\"nofollow\">https://mathieu.fenniak.net/the-api-checklist/</a></p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>: &nbsp;Asset APIs use RESTful design patterns and uses versioning in the URI - OR&nbsp;- standard parseable document technologies for data transfer (SOAP, XML, JSON, GeoJSON, KML, etc. over HTTP) and documents contains versioning information AND service endpoints for the different versions of the API are maintained across versions.</p> \n<p><strong>Example good answer</strong>: Asset APIs&nbsp;use standard parseable document technologies for data transfer (SOAP, XML, JSON, GeoJSON, KML, etc. over HTTP) - OR - service interface uses RESTful design patterns BUT no versioning in the API or the XML documents.</p> \n<p><strong>Example bad answer</strong>:&nbsp;Asset APIs&nbsp;use proprietary, platform-dependent interfaces (e.g. RPC, JDBC) AND/OR API methods and arguments contain implemetation-specific information (e.g. arguments matching the underlying database column headers).</p>","objective":"","qid":"120","question":"<p>Are the APIs well designed for ease of use and integration?</p> \n<p>If your asset has exposed APIs, please identify all of the following that apply to the APIs:</p> \n<ul> \n <li>Uses RESTful design patterns</li> \n <li>Uses versioning in the URI</li> \n <li>Uses standard parse-able document technologies for data transfer (e.g., SOAP, XML, JSON, GeoJSON, KML, etc. over HTTP)</li> \n <li>Data documents contain version information</li> \n <li>Different versions of the API are maintained across releases</li> \n</ul> \n<p>For item #1 above, please identify the resources, URIs to those resources, and which HTTP verbs are applied to each resource</p> \n<p>For item #3 above, please identify what parse-able document technology(s) your asset implements</p>","questionId":"d52b65ef-a3b5-43d4-92b9-34a173eb9f03","scoreCriteria":"<div class=\"table-wrap\">\n  &nbsp; \n</div> \n<p>Does it follow well known design patterns (REST, SOAP, JDBC, best practices for library design for the language and platform )&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p>Does is use standard data formats or conventions (XML, JSON, KML, GeoJSON, WMS, &nbsp;etc)&nbsp;<strong>+1</strong></p> \n<p>Are APIs&nbsp;backwards compatibility and support versioning&nbsp;<strong>+1</strong></p> \n<p>Is the API easy to understand, useful, and documented&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p>Is the API complete and fully functioning&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p>&nbsp;</p> \n<p>&nbsp;</p> \n<p><strong>N/A</strong>&nbsp;= no exposed (external facing) APIs&nbsp;</p> \n<p>&nbsp;</p> \n<p><strong>Add the numbers to the right of each item above</strong></p>","evaluationSectionDescription":"Integrable"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.222Z","createUser":"rex.nethercott","updateDts":"2017-10-04T18:52:11.445Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"d709caaa-1b64-4cf0-8206-bdaffaa2e924","response":"<p>This asset works by being given pre-built project that provides instructions on how to run. User input is not an issue as much as proper programming for the language.</p>","responseId":"52fe7dd3-06b3-4498-afd7-e39bfb3fdfee","score":3,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:42:15.233Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:42:15.233Z","updateUser":"devin.shurtleff","evaluationSection":"IO","narrative":"<p>This question applies to all assets that have user interfaces, and is getting at whether and how consistently user input is validated during or after entry and what visual feedback is provided back to the user.User input validation may include but not limited to the following:</p> \n<ul> \n <li>Boundary and range checking, such as min / max for numeric, min / max length for strings, choice from a list of allowed values</li> \n <li>Check for input of required fields</li> \n <li>Data type specific checks for validity (e.g. email addresses, phone numbers, URLs, coordinates)</li> \n <li>Security checks (e.g. illegal characters, injected scripts)</li> \n</ul> \n<p>Meaningful feedback should be provided to the end user to correct the erroneous inputs. To that end, client-side input validation (e.g. using JavaScript) is desired,&nbsp;so immediate feed-back can be provided to user before focus leaves field.&nbsp;Note that, when using client-side input validations, it is still important to have server-side validation, to prevent ill-intentioned clients from bypassing the client-side UI and access the server-side API directly.</p> \n<p>Note that validation code may be centralized within client-side implementation to enhance code verification, or if available, both client-side and server-side validation code can be provided by 3rd party framework instead of hand-coded/ad-hoc implementation.&nbsp; Ultimately, all inputs should be checked to ensure values are within defined bounds (e.g., min/max for numeric, min/max length for strings). All form data values/Server request parameters should be checked for valid syntax for target data type, e.g., integer, email, decimal (aka floating pt), URL, UTF-8 encoding.</p> \n<p>Additional information can be found on the OWASP site as well -&nbsp;<a href=\"https://www.owasp.org/index.php/Input_Validation\" rel=\"nofollow\">https://www.owasp.org/index.php/Input_Validation</a>.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS, although for COTS and GOTS where source code is not provided this question will have to be evaluated in I&amp;T by trying to enter invalid parameters. &nbsp;For assets where the source code is available&nbsp;this question can be answered via spot checking the code. &nbsp;Spot checking the code involves the evaluator picking 3 or 4 user input locations and actually looking at the code that processes these inputs and validating via inspection that input validation is occurring.</p> \n<p><strong>Example best answer</strong>:&nbsp;&nbsp;All user input is validated during entry, so immediate feed-back can be provided to user before focus leaves field.</p> \n<p><strong>Example good answer</strong>: Most user inputs are validated on input OR all user inputs are validated but done so on the server side and there is delay in the response to the user AND&nbsp; the user feedback is good</p> \n<p><strong>Example bad answer:&nbsp;&nbsp;</strong>No user inputs are validated - OR - user inputs are validated but there is no user feedback OR the user feedback is cryptic and non-explanatory/understandable</p>","objective":"<p>This question applies to all assets that have user interfaces and asks whether, and how consistently, user input is validated during (or after) entry.</p> \n<p>Note that some UIs validate user input during entry, so immediate feed-back can be provided to user before focus leaves field. Other user input may get validated on the server side, in which case there may be some delay before the user gets a response.</p>","qid":"130","question":"<p>How well does the asset validate user input?</p> \n<p>Please describe how your asset user interface validates&nbsp;<strong>user input</strong>, by&nbsp;selecting which of the below applies to your asset:</p> \n<p><em>All</em>&nbsp;(100%) user input is validated during entry (i.e., client-side)</p> \n<p><em>Most</em>&nbsp;(51%-99%) user input is validated during entry</p> \n<p><em>Some (10%-50%)&nbsp;</em>user input is validated during entry</p> \n<p>No user input is validated on the client</p> \n<p>N/A - the asset does not provide a user interface</p>","questionId":"d709caaa-1b64-4cf0-8206-bdaffaa2e924","scoreCriteria":"<p>All user input is validated during entry&nbsp;<strong>4</strong></p> \n<p>Most user input is validated during entry&nbsp;<strong>3</strong></p> \n<p>Some user input is validated during entry&nbsp;<strong>2</strong></p> \n<p>&nbsp;No user inputs are validated&nbsp;<strong>1</strong><strong><br></strong></p> \n<p>Understandable feedback is provided&nbsp;<strong>(add one point to the score above)</strong><br><strong><br></strong></p> \n<p>N/A - the asset does not provide a user interface</p> \n<p><strong>The number to the right of each item above is the score.</strong></p> \n<p><strong>NOTE: Add 1 to the score if understandable feedback is provided to the user</strong></p>","evaluationSectionDescription":"I/O Validation"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.223Z","createUser":"rex.nethercott","updateDts":"2017-10-11T20:58:20.153Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"a2bab1cf-6d97-4b2e-8e95-2f8194926601","response":"<p>Not applicable.&nbsp;This is something that is built rather than something that is implemented or called.</p>","responseId":"a4f01746-a0fc-465d-bba5-660154b3f033","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:43:18.398Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:43:18.398Z","updateUser":"devin.shurtleff","evaluationSection":"IO","narrative":"<p>This question applies to all assets that have API interfaces (for widgets this would be data coming from events/channels/intents, not from user input). Programmatic input validation may include but not limited to the following:</p> \n<ul> \n <li>Boundary and range checking, such as min / max for numeric, min / max length for strings, choice from a list of allowed values</li> \n <li>Check for input of required fields</li> \n <li>Data type specific checks for validity (e.g. email addresses, phone numbers, URLs, coordinates)</li> \n <li>Security checks (e.g. illegal characters, injected scripts)</li> \n</ul> \n<p>Meaningful feedback should be provided to the caller to correct the erroneous inputs. To that end, client-side input validation is desired,&nbsp;so immediate feed-back can be provided without waiting for the round-trip to the server-side component.&nbsp;Note that, when using client-side input validations, it is still important to have server-side validation, to prevent ill-intentioned clients from bypassing the client-side library and access the server-side API directly.</p> \n<p>The scoring criterion is self-explanatory, and should be verified against documentation, testing events, and/or via spot checking the code. &nbsp;Spot checking the code involves the evaluator picking 3 or 4 interfaces and actually looking at the code that implements these interfaces, and validating via inspection that input validation is occurring.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS, although for enterprise services, COTS, and GOTS assets where source code is not available this will have to be evaluated in I&amp;T by sending into the API invalid parameters and observing whether the asset behaves appropriately.</p> \n<p><strong>Example best answer</strong>:&nbsp; All API input arguments are validated on input, and appropriate responses in the form of error codes and/or text are provided in the API response - AND- if the responses are in error codes the error codes are well documented and the narrative text describing the error codes is understandable.</p> \n<p><strong>Example good answer</strong>: All API input arguments&nbsp;are validated but there is limited&nbsp;feedback on errors or the error codes are not defined or the definitions are&nbsp;cryptic</p> \n<p><strong>Example bad answer:&nbsp;&nbsp;</strong>None, or only some, of the API&nbsp;input arguments&nbsp;are validated</p>","objective":"<p>This question applies to all assets that have APIs (for widgets this would be data coming from events/channels/intents, not from user input), and asks which input parameters (if any) are being validated.&nbsp;</p>","qid":"140","question":"<p>How well does the asset validate programmatic input?</p> \n<p>Please describe how your asset APIs validate&nbsp;<strong>programmatic input</strong>&nbsp;by selecting which of the below applies to your asset :</p> \n<p><em>All</em>&nbsp;(100%) API arguments are validated on input</p> \n<p><em>Most</em>&nbsp;(51%-99%)&nbsp;API arguments are validated on input</p> \n<p><em>Some&nbsp;<em>(10%-50%)&nbsp;</em></em>API input arguments are validated on input</p> \n<p>No&nbsp;API&nbsp;input arguments&nbsp;are validated.</p> \n<p>N/A - if asset does not provide an API</p>","questionId":"a2bab1cf-6d97-4b2e-8e95-2f8194926601","scoreCriteria":"<p>All API input arguments are validated&nbsp;<strong>4</strong></p> \n<p>Most API input arguments are validated&nbsp;<strong>3</strong></p> \n<p>Some API input arguments are validated&nbsp;<strong>2</strong></p> \n<p>&nbsp;No API inputs are validated&nbsp;<strong>1</strong></p> \n<p>Understandable feedback is provided via error codes on return&nbsp;<strong>(add one point to the score above)</strong></p> \n<p><strong>The number to the right of each item above is the score.</strong></p> \n<p><strong>NOTE: Add 1 to the score if understandable feedback is provided to the consumer</strong></p>","evaluationSectionDescription":"I/O Validation"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.23Z","createUser":"rex.nethercott","updateDts":"2017-10-11T20:58:51.136Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"314a2230-fdc7-4203-98da-d5f44b2e2bc7","response":"<p>Cross-site scripting issues are not addressed. Nor are they really applicable.</p>","responseId":"82c6c97c-b3ed-474a-b6b6-b56708b0317a","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:45:52.574Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:45:52.574Z","updateUser":"devin.shurtleff","evaluationSection":"IO","narrative":"<p>This question is getting at whether the output has been properly validated before sending to the original requester or forwarding to another service, etc.&nbsp; Output validating is particularly important for enterprise services or for redeployable applications that provide a web service.&nbsp; One thing to look for from a design perspective is whether the output can be exploited by a smart developer (e.g., if it uses consecutive numbers as customer identifiers, any one customer can fairly easily take advantage of that fact and find out data about other customers).&nbsp; The best way to validate this is by inspection - of both the API and its implementation, and/or via looking at whether the SDLC process has explicitly called out output validation as a concern and provided developers a list of things to check (e.g., see #4 below)&nbsp;</p> \n<p>Output validation also includes ensuring that all output data is not only functionally and syntactically correct, but that they also conform to the published API specification. An asset may, for instance, return a valid XML document as output, but the document may not necessarily conform to the published XML schema (XSD or DTD). In the ideal case, the output data is automatically checked against the schema for conformance, before the response is sent (certain XML appliances provide this functionality separate from the software code).</p> \n<p>1) From the OWASP site (<a href=\"https://www.owasp.org/index.php/Output_Validation\" rel=\"nofollow\">https://www.owasp.org/index.php/Output_Validation</a>):</p> \n<p>Output validation refers to the process of validating the output of a process before it is sent to some recepient. For example, if you search your output for credit card numbers and replace them with asterisks (*), you have validated the output before sending it. You might also validate the output for common attacks, such as&nbsp;<a title=\"Cross-site Scripting (XSS)\" href=\"https://www.owasp.org/index.php/Cross-site_Scripting_%28XSS%29\" rel=\"nofollow\">Cross-site Scripting (XSS)</a>&nbsp;and&nbsp;<a title=\"SQL Injection\" href=\"https://www.owasp.org/index.php/SQL_Injection\" rel=\"nofollow\">SQL Injection</a>&nbsp;before sending it.</p> \n<p>NOTE: See&nbsp;<a title=\"HTML Entity Encoding\" href=\"https://www.owasp.org/index.php/HTML_Entity_Encoding\" rel=\"nofollow\">HTML Entity Encoding</a>&nbsp;which is a sort of output validation.</p> \n<p>2) From the Security Ninja site (<a href=\"http://www.securityninja.co.uk/secure-development/output-validation/\" rel=\"nofollow\">http://www.securityninja.co.uk/secure-development/output-validation/</a>)</p> \n<div> \n <p>In addition to validating all of the data your application receives you should also follow similar processes for the data your application will output. Some attacks such as Cross Site Scripting can take advantage of poorly validated output to attack unsuspecting end users through your application. There are three main issues associated with output validation that you should always aim to address in your application; they are data encoding, data format and data length.</p> \n <p>The data encoding process is slightly different depending on where your output is going to end up. For example if your data is going into a URL you need to ensure it is URL encoded. We have included an example below of a malicious value appended to a URL and how URL encoding of this data would remove the threat.</p> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - See more at:&nbsp; \n <a href=\"http://www.securityninja.co.uk/secure-development/output-validation/#sthash.2d5YFj7c.dpuf\" rel=\"nofollow\">http://www.securityninja.co.uk/secure-development/output-validation/#sthash.2d5YFj7c.dpuf</a> \n</div> \n<p>3) From wikipedia (<a href=\"http://en.wikipedia.org/wiki/Secure_input_and_output_handling\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Secure_input_and_output_handling</a>):</p> \n<h2><span>Output handling</span></h2> \n<p>Output handling is how an application, server or system handles the output (e.g. generating HTML, printing, logging, ...). It is important to keep in mind output often contains input supplied from users, clients, network, databases etc.</p> \n<p>Secure output handling is primarily associated with preventing&nbsp;<a title=\"Cross-site Scripting\" href=\"http://en.wikipedia.org/wiki/Cross-site_Scripting\" rel=\"nofollow\">Cross-site Scripting</a>&nbsp;(XSS) vulnerabilities, but could also prove to be important in similar areas (e.g. if generating Microsoft Office documents with some API, output management could potentially be required to prevent macro-injections).</p> \n<h3><span>Encode (escape) output</span></h3> \n<p>\"Encoding\" processes content that is about to be output so that any potentially dangerous characters are made safe. Characters from a typical known safe&nbsp;<a title=\"Charset\" href=\"http://en.wikipedia.org/wiki/Charset\" rel=\"nofollow\">charset</a>&nbsp;for the particular destination medium are often left as they are. A simple encoding might leave alone alphanumerics&nbsp;<em>a-z</em>,&nbsp;<em>A-Z</em>&nbsp;and&nbsp;<em>0-9</em>. Any other characters could be possibly interpreted in an unexpected manner, and are therefore replaced with the appropriate \"encoded\" representation.</p> \n<p>HTML encoding:&nbsp;<em>&lt;script&gt;</em>&nbsp;is encoded to&nbsp;<em>&amp;lt;script&amp;gt;</em></p> \n<p>In&nbsp;<a title=\"PHP\" href=\"http://en.wikipedia.org/wiki/PHP\" rel=\"nofollow\">PHP</a>&nbsp;this can be done with the function htmlspecialchars()<sup><a href=\"http://en.wikipedia.org/wiki/Secure_input_and_output_handling#cite_note-3\" rel=\"nofollow\">[3]</a></sup></p> \n<p>4) Additionally, from another discussion on this topic (<a href=\"https://groups.google.com/forum/#%21topic/iso27001security/cdQFviCwCrw\" rel=\"nofollow\">https://groups.google.com/forum/#!topic/iso27001security/cdQFviCwCrw</a>):</p> \n<p>According to their security designs, output from application systems must be checked to ensure that processing has completed correctly and accurately, using controls such as:. Reconciliation of input/output control totals e.g. batch input totals or balances match batch output totals or balances; Validation of output data values e.g. correct range and type; Plausibility checks using business logic, consistency and correlation techniques to check whether the output is reasonable; Completeness checks e.g. all input records processed with no errors and hold file empty; Backup-restore, checkpoint and rollback processes to reverse invalid program runs gracefully,&nbsp; accurately, completely and reliably; Recording relevant information (including validation pass/fail) in application logs, audit trails etc.; Input validation checks on downstream systems.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS, although for enterprise services, COTS, and GOTS assets where source code is not available this will have to be evaluated in I&amp;T by sending into the API invalid parameters and observing whether the asset behaves appropriately.</p> \n<p><strong>Example best answer</strong>:&nbsp; All API output arguments are validated to match the API specification, and properly encoded, prior to sending to the consuming application.</p> \n<p><strong>Example good answer</strong>: Most API output arguments&nbsp;are validated to match the API specification, but some are not - or are not properly encoded.</p> \n<p><strong>Example bad answer:&nbsp;&nbsp;</strong>None of the API&nbsp;output arguments&nbsp;are validated to ensure they conform to the API specification, nor are they properly encoded.</p> \n<p>&nbsp;</p> \n<p>Note that this question can be answered via testing and/or via spot checking the code. &nbsp;Spot checking the code involves the evaluator picking 3 or 4 interfaces and actually looking at the code that implements these interfaces, and validating via inspection that output validation is occurring.</p>","objective":"<p>Has the output has been properly validated before sending to the original requester or forwarding to another service, etc.?</p> \n<p>From OWASP:</p> \n<p>Output validation refers to the process of validating the output of a process before it is sent to some recepient. For example, if you search your output for credit card numbers and replace them with asterisks (*), you have validated the output before sending it. You might also validate the output for common attacks, such as&nbsp;<a title=\"Cross-site Scripting (XSS)\" href=\"https://www.owasp.org/index.php/Cross-site_Scripting_(XSS)\" rel=\"nofollow\">Cross-site Scripting (XSS)</a>&nbsp;and&nbsp;<a title=\"SQL Injection\" href=\"https://www.owasp.org/index.php/SQL_Injection\" rel=\"nofollow\">SQL Injection</a>&nbsp;before sending it.</p> \n<p>From Security Ninja:&nbsp;</p> \n<p>There are three main issues associated with output validation that you should always aim to address in your application; they are data encoding, data format and data length.</p> \n<p>The data encoding process is slightly different depending on where your output is going to end up. For example if your data is going into a URL you need to ensure it is URL encoded. We have included an example below of a malicious value appended to a URL and how URL encoding of this data would remove the threat.</p> \n<p>See&nbsp;<a href=\"https://www.owasp.org/index.php/Output_Validation\" rel=\"nofollow\">https://www.owasp.org/index.php/Output_Validation</a>,&nbsp;<a href=\"https://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet#Output_Encoding_Rules_Summary\" rel=\"nofollow\">https://www.owasp.org/index.php/XSS_(Cross_Site_Scripting)_Prevention_Cheat_Sheet</a>, and&nbsp;<a href=\"http://www.securityninja.co.uk/secure-development/output-validation/\" rel=\"nofollow\">http://www.securityninja.co.uk/secure-development/output-validation/</a>&nbsp;for more information on validation of encoding rules on output</p>","qid":"150","question":"<p>Is the asset protected against&nbsp;harmful input and output&nbsp;?</p> \n<p>Please describe how your asset protects against Cross Site Scripting attacks.</p> \n<p><strong>Note:&nbsp;</strong>Data sanitizing involves removing special characters such as HTML or SCRIPT tags. Context-sensitive sanitizing is only possible on output, and involves removing or adjusting characters that are \"special\" depending on the context (e.g., HTML and SCRIPT tags removed on output for RESTful APIs, HTML escaping for dynamic web page content, etc). see&nbsp;<a href=\"http://security.stackexchange.com/questions/9415/filter-user-input-before-the-database-or-upon-display\" rel=\"nofollow\">http://security.stackexchange.com/questions/9415/filter-user-input-before-the-database-or-upon-display</a>&nbsp;for additional information</p>","questionId":"314a2230-fdc7-4203-98da-d5f44b2e2bc7","scoreCriteria":"<div class=\"table-wrap\">\n  &nbsp; \n</div> \n<p>Data sanitized input<strong>&nbsp;+1</strong></p> \n<p>Data sanitized output<strong>&nbsp;+1</strong></p> \n<p>Type checking is used&nbsp;<strong>+1</strong></p> \n<p>SQL injection protection&nbsp;<strong>+1</strong></p> \n<p>Protection from reverse engineering of binary using checksum etc.&nbsp;<strong>+1</strong></p> \n<p>Encrypts and protects sensitive data&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p><strong><strong>Add the numbers to the right of each item above</strong></strong></p> \n<p>5 = 6 above<br>4 = 5 above&nbsp;<br>3 = 3 or 4 above<br>2 = 2 above<br>1 = 1<strong>&nbsp;</strong></p>","evaluationSectionDescription":"I/O Validation"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.231Z","createUser":"rex.nethercott","updateDts":"2017-10-04T18:56:38.837Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"44346c51-13db-4a29-8113-533616af291d","response":"<p>Test data is provided&nbsp;<strong>+1</strong></p> \n<p>Test Results are not provided, but further evidence is provided to validate testing&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p>","responseId":"4cde5331-466f-402f-adf5-2f0c3c9117be","score":2,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:48:51.776Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:48:51.776Z","updateUser":"devin.shurtleff","evaluationSection":"TEST","narrative":"<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Is the asset tested at the asset level?&nbsp;</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: This question is getting at whether the asset owner dedicates time and effort testing the asset itself as opposed to only testing the system that the asset is part of.&nbsp;&nbsp; This is important to asses because a particular \"end-2-end\" test that applies to one system will likely not apply to a different system that wants to re-use the particular asset.&nbsp; In order for an asset to be \"enterprise grade\", the asset owner needs to emphasize testing the asset itself.&nbsp; By emphasizing the asset-level testing, the asset owner (and subsequent re-users) can be assured that the asset can be re-used in different end-2-end scenarios than those that the asset owner first considered.&nbsp;</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS. &nbsp;Evidence that such testing has occured will be based on interviews with the asset owner, and the availability of testing artifacts that show asset-level testing (e.g., test plans and results, etc.)</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: the asset owner has specifically emphasized testing of the asset itself</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: the asset owner has some emphasis on testing the asset itself, but most emphasis is on system-level test</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: the asset owner has only ever tested the asset in system level tests</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>: Are asset-level tests&nbsp;documented so they can be repeated?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: This question is looking to see whether asset level testing artifacts actually exist (e.g. test plans, processes, procedures) and can be re-used so that the asset level tests can be repeated either by the asset owner or a 3rd party.&nbsp;</p> \n<p>Examples of testing artifacts include the following:</p> \n<ul> \n <li>Test plan, which documents the overall testing strategy, process, and roles and responsibilities</li> \n <li>Test cases, including scenarios and detailed procedures</li> \n <li>Test results and reports</li> \n</ul> \n<p>To score high, the testing processes, procedures, and artifacts should be documented.</p> \n<p>Documented expected results in test cases is important to ensure repeatability and objectivity in testing, esp. regression testing.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>:&nbsp; Asset level testing processes, procedures, and artifacts are documented for reuse.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>:&nbsp;Some asset level testing processes, procedures, and artifacts are documented.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>:&nbsp;No asset level testing concepts, processes, procedures, or artifacts are documented.</p> \n<p>&nbsp;</p> \n<div class=\"wiki-content\"> \n <p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Are test datasets&nbsp;available?</p> \n <p>&nbsp;</p> \n <p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: This question is about whether test data&nbsp;used to run asset level test cases is available for others to use.&nbsp; Many tests require good test data to be able to validate both functionality as well as error handling.&nbsp; Having the&nbsp; test data available for others to re-use makes testing in other conditions much easier for the potential consumer of the asset.</p> \n <p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n <p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: All test data, or a test data generator, is packaged and available for re-use.</p> \n <p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: Some test data is available for re-use</p> \n <p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: No test datasets are provided</p> \n</div>","objective":"<p>Determine if asset tests focus on happy path only, or if they also exercise \"edge cases\" and \"corner cases\" to test boundary and extreme conditions?</p> \n<p>&nbsp;</p> \n<p>Such testing may be accomplished by leveraging test tools (e.g., SoapUI) and by automated test scripts being kicked off during Continuous Integration.</p> \n<p>It is helpful to consumers of the asset to be able to leverage existing test data and other testing artifacts for an asset so they can repeat the tests in different environments.</p>","qid":"160","question":"<p>Are Test Reports available for the asset?</p> \n<p>Please provide test reports (test cases and results) related to your asset that address the following:</p> \n<p>a. Load</p> \n<p>b. Performance</p> \n<p>c. Scalability</p> \n<p>d. Security</p> \n<p>&nbsp;</p> \n<p>Please also provide test data so that tests may be repeated</p>","questionId":"44346c51-13db-4a29-8113-533616af291d","scoreCriteria":"<div class=\"table-wrap\">\n  &nbsp; \n</div> \n<p>Load test cases and results provided&nbsp;<strong>+1</strong>&nbsp;</p> \n<p>Performance test cases and results provided&nbsp;<strong>+1</strong></p> \n<p>Scalability test cases and results provided&nbsp;<strong>+1</strong></p> \n<p>Test data is provided&nbsp;<strong>+1</strong></p> \n<p>Test Results are not provided, but further evidence is provided to validate testing&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p>&nbsp;</p> \n<p><strong><strong>Add the numbers to the right of each item above to get the score. If none are selected, the minimum score is 1.</strong></strong></p>","evaluationSectionDescription":"Testing"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.233Z","createUser":"rex.nethercott","updateDts":"2017-10-11T20:59:32.944Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"2bff2ec1-ba37-4858-aca2-c9af8bdba96d","response":"<p>The UI does not exist for this asset. Rather it is executed on a cluseter.</p>","responseId":"f56c27c3-8b57-4646-9d88-59dc011ee4f1","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T15:49:47.273Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T15:49:47.273Z","updateUser":"devin.shurtleff","evaluationSection":"TEST","narrative":"<p>This question applies to enterprise services or redeployable capabilities that include a user interface, and is getting at whether testing and evaluation activities have specifically included usability testing as a conscious effort.&nbsp; This is important to ensure end user buy-in.&nbsp; Usability is an important quality attribute and often determines the ultimate acceptance and \"popularity\" across the larger community. Testing and evaluation activities, therefore, should include usability as an integral part of the testing activities, along with functional testing, performance testing, etc. Here this question's scoring criteria describe three levels of maturity in usability testing:</p> \n<ul> \n <li>In the best case scenario, the asset's UIs have been through formal usability testing based on well-defined metrics and test cases (e.g. personas, scenarios, etc.). One of the most important metrics is end user feedback on the ease-of-use and friendliness of the asset. If events such as an Operational Utility Evaluation (OUE) has been conducted and user feedback gets incorporated into the system development, the asset is likely to have strong buy-in from the user community.</li> \n</ul> \n<ul> \n <li>In a less ideal scenario, the asset's UIs have been through informal usability expert evaluation or heuristics-based review based on well-defined metrics (e.g. Nielsen's Heuristics) and test cases, but no formal usability testing is conducted. In this case, the team has make a conscious effort to review the asset's usability from the user's perspective, but no usability testing involving end user feedback is conducted.</li> \n</ul> \n<ul> \n <li>In the the worse case, usability test cases and metrics are not defined; no explicit usability testing has been conducted. This lack of a conscious effort by the asset development team is often the result of a \"we know best what users want\" mentality and may hinder the asset's acceptance and incur serious technical debt in the future.</li> \n</ul> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: The UI has been through formal usability testing based on well-defined metrics and test cases (e.g. personas, scenarios, etc.), incorporating end user feedback.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: The UI has been through informal usability expert evaluation or heuristics-based review based on well-defined metrics (e.g. Nielsen's Heuristics).</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>:&nbsp; Usability test cases and metrics are not defined; no explicit usability testing has been conducted.</p>","objective":"<p>This question only applies to those assets that include a user interface, and is getting at whether testing and evaluation activities have specifically included usability testing as a conscious effort.</p>","qid":"170","question":"<p>How well was the User Interface tested?</p> \n<p>If your asset provides a UI, please provide test reports (test cases and results)&nbsp;how the UI has been tested and evaluated with regard to usability.</p> \n<p>Please describe the testing performed using the following:</p> \n<p>a. The UI has been through&nbsp;<em>formal</em>&nbsp;usability testing based on well-defined metrics and test cases (e.g., personas, scenarios, etc.), incorporating end user feedback.</p> \n<p>b. The UI has been through&nbsp;<em>informal</em>&nbsp;usability expert evaluation or heuristics-based review based on well-defined metrics (e.g. Nielsen's Heuristics).</p> \n<p>c. The UI has been through end-user testing where end-users were able to fully exercise the UI and provide feedback - but no specific test cases or metrics were used.</p> \n<p>d. Usability test cases and metrics are not defined; no explicit usability testing has been conducted.</p> \n<p>N/A - asset does not provide a UI</p> \n<p>Other, Please specify.</p>","questionId":"2bff2ec1-ba37-4858-aca2-c9af8bdba96d","scoreCriteria":"<p>The UI has been through&nbsp;<em>formal</em>&nbsp;usability testing&nbsp;<strong>4</strong></p> \n<p>The UI has been through&nbsp;<em>informal</em>&nbsp;usability testing&nbsp;<strong>3</strong></p> \n<p>The UI has been through end-user testing&nbsp;<strong>2</strong></p> \n<p>Usability test cases and metrics are not defined&nbsp;<strong>1</strong></p> \n<p>Test Cases and results were provided&nbsp;<strong>(add one point to the score above)</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Testing"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.234Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:02:49.131Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"f0e68568-edfb-4f39-be8c-cc2afebecdb5","response":"<p>2 usage metrics and 4 auditing events are generated<strong>&nbsp;3</strong></p> \n<p>These are custom and could be built as needed.</p>","responseId":"7ddf6f40-a325-454a-a4df-73b9122320bd","score":3,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:17:20.466Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T16:17:20.466Z","updateUser":"devin.shurtleff","evaluationSection":"MON","narrative":"<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: This question looks to see whether an asset provides mechanisms for collecting its runtime metrics. In a component-based, service-oriented architecture, an asset cannot expect to have its own dedicated monitoring and maintenance operations; rather, the asset should in general lend itself to be monitored and maintained as part of a larger system deployment. To this end, it is desirable to have API-level integration \"hooks\" for up-to-date asset usage data such as:</p> \n<ul> \n <li>Status and health (e.g. a sub-component failure, a communication timeout, etc.)</li> \n <li>Utilization / load (e.g. response time, thoughput)</li> \n <li>Abnormal usage as it occurs (e.g. violation of SLAs)</li> \n <li>Transactional data for auditing purposes (e.g. user ID and timestamp for major events)</li> \n</ul> \n<p>Such APIs may be \"push\" and/or \"pull\", although the former is more common in a \"monitoring agent&nbsp;– monitoring sever\" architecture, where each asset contains a monitoring agent that feeds usage data to a dedicated monitoring server. Such architectures have been widely used in the system management and network management domains (e.g. the CMIP and SNMP protocols) as well as modern software frameworks (e.g. JMX). SOA systems, in particular, leverage service management and monitoring specifications such as Web Services Distributed Management (WSDM) and WS-Notification to enable loose-coupling between service components being monitored and the monitoring functions themselves.</p> \n<p>For finer-grained assets (e.g. a UI widget), monitoring may be achieved through integration \"hooks\" already provided in the container framework (e.g. OWF, JEE).</p> \n<p>To score high in this question, the asset should not only provide sufficient runtime mechanisms for the collection of aforementioned metrics, but should ideally leverage standard-based protocols and/or platform-independent frameworks for the exchange of such metrics, in order to avoid locking in to a proprietary monitoring/auditing architecture or product.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: The asset provides sufficient standard-based and/or framework-provided integration points for collecting runtime metrics in a platform- and product-independent fashion.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: The asset provides&nbsp;sufficient APIs or leverages framework-provided integration points for collecting runtime metrics but requires platform- or product-specific integration</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: The asset does not provide sufficient mechanisms for runtime monitoring.</p>","objective":"<p>This question asks if an asset provides mechanisms for collecting its usage and auditing metrics.&nbsp;</p>","qid":"180","question":"<p>How well does the asset support usage metrics and auditing?</p> \n<p>Please select which of the below categories of usage metrics and auditing events your asset generates, and provide details defining the specific metrics/events:</p> \n<p>Usage Metrics:</p> \n<ul> \n <li>Throughput (e.g., queries per second, requests per second)</li> \n <li>Success&nbsp;metrics (e.g., % of requests resulting in HTTP 2xx codes)</li> \n <li>Error&nbsp;metrics&nbsp;(e.g., % of requests resulting in HTTP 5xx codes)</li> \n <li>Performance&nbsp;metrics (e.g., latency, or how much time to complete a unit of work)</li> \n</ul> \n<p>Auditing Events:</p> \n<ul> \n <li>Input validation failures</li> \n <li>Output validation failures</li> \n <li>Authentication successes and failures</li> \n <li>Authorization (access control) failures</li> \n <li>Session management failures</li> \n <li>Application errors and system events (e.g. syntax and runtime errors, connectivity problems, etc.)</li> \n <li>Application start-ups and shut-downs</li> \n <li>Use of higher-risk functionality (e.g. use of systems administrative privileges)</li> \n</ul>","questionId":"f0e68568-edfb-4f39-be8c-cc2afebecdb5","scoreCriteria":"<p>All listed usage metrics and auditing events generated&nbsp;<strong>5</strong></p> \n<p>3 usage metrics and 6 auditing events are generated<strong>&nbsp;4</strong></p> \n<p>2 usage metrics and 4 auditing events are generated<strong>&nbsp;3</strong></p> \n<p>1 usage metric and 2 auditing events are generated<strong>&nbsp;2</strong></p> \n<p>No usage metrics or auditing events generated<strong>&nbsp;1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Monitoring"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.235Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:04:45.691Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"e5e8261d-3808-49ab-8690-9750685960da","response":"<p>This is not applicable, the logging strategy is unique to the streaming service and depends on other factors; such as number of producers, consumers, clusters, etc...</p>","responseId":"4d9400f8-88f7-4a1b-b070-518586bf1926","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:19:34.875Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T16:19:34.875Z","updateUser":"devin.shurtleff","evaluationSection":"MON","narrative":"<p>The ability to provide detailed, configurable logging is often a tell-tale sign of how well the component's developers followed mature software engineering practices. For Java-based components, for example, robust logging frameworks such as log4j should be used to provide consistency in log level configuration. Furthermore, configurable levels of logging can be adjusted to provide detailed debugging information during integration testing, and suppress excessive logging to boost performance in the operational environment.</p> \n<p>Having to recompile or change code to change debug levels hinders debugging in production environments or can have an adverse impact on performance.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>: Logging levels are configurable for each execution environment (e.g., using log4j levels)</p> \n<p><strong>Example good answer:</strong>&nbsp;Logging levels are defined but not easily configurable</p> \n<p><strong>Example bad answer:</strong>&nbsp;&nbsp;Logging levels are not configurable</p>","objective":"<p>Some logging frameworks (such as log4j) enable logging levels to be configured during run-time. In other frameworks log levels need to be configured at start-up. In yet other cases, logging is only provided at one level and cannot be configured at all - or is non-existent.</p>","qid":"190","question":"<p>How well does the asset support logging?</p> \n<p>If your asset supports logging, please identify what logging levels can be configured (e.g., FAIL, WARNING, DEBUG, etc.).</p> \n<p>Please also identify whether the logging can be configured during run time, or requires a restart of your asset</p> \n<p>If your asset supports logging, please select which of the following applies:</p> \n<ul> \n <li>Level of detail can be configured&nbsp;(e.g., FAIL, WARNING, DEBUG, etc.)</li> \n <li>Log implements a rotation strategy (i.e., begins overwriting older log entries as max size is approached)</li> \n <li>Log entries are in parse-able format (e.g., JSON)</li> \n <li>Log entries are complete (i.e., capture the following: \n  <ul> \n   <li>Who&nbsp;(e.g., userName)</li> \n   <li>When&nbsp;(e.g., timestamp)</li> \n   <li>Where (e.g., context, servlet or page, database)</li> \n   <li>What (e.g., command)</li> \n   <li>Result&nbsp;(e.g., exception)</li> \n  </ul> </li> \n</ul>","questionId":"e5e8261d-3808-49ab-8690-9750685960da","scoreCriteria":"<div class=\"table-wrap\">\n  &nbsp; \n</div> \n<p>Level of detail can be configured&nbsp;<strong>+1</strong></p> \n<p>Log implements a rotation strategy&nbsp;<strong>+1</strong></p> \n<p>Log entries are in parse-able format&nbsp;<strong>+1</strong></p> \n<p>Log entries are complete&nbsp;<strong>+1</strong></p> \n<p>Log entries are partially complete&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p><strong><strong>Add the numbers to the right of each item above to get the score. If none are selected, the minimum score is 1.</strong></strong></p>","evaluationSectionDescription":"Monitoring"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.237Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:09:22.585Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"480966ba-9eea-4d11-b1e5-e01284ebf3ac","response":"<p>No actual measurements provided<strong>&nbsp;1</strong></p> \n<p>It is mentioned in documentation how the asset has been shown to scale linearly across Hadoop clusters under extreme loads of billions of events per second.</p>","responseId":"31c1a30f-a1d1-4deb-99b2-342a0d3704c7","score":1,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:21:35.709Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T16:21:35.709Z","updateUser":"devin.shurtleff","evaluationSection":"PER","narrative":"<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Does UI experience any notable response delay to specific operations?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: The question is concerned with the responsiveness of UI. A responsive user interface should immediately reacts to user input with no discernible delay &nbsp;(e.g., a map widget becomes unresponsive while loading its KML layers). As a rule of thumb, it should usually&nbsp;take less than 3 seconds to respond to user action and provides visual feedback to the user when the operation is expected to take longer than 1-2 seconds. The scoring criterion identifies three levels of responsiveness:</p> \n<p>&nbsp;This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: UI&nbsp;immediately reflects user input with no discernible delay and usually takes less than 3 seconds to respond to user action and provides feedback to the user when the delay is longer than 2 seconds (e.g., hour glass icon is display for map loading).</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: UI immediately reflects user input with no discernible delay and usually takes less than 6 seconds to respond to user action, and provides feedback to the user that it is in process when delay is longer than 4 seconds.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: UI&nbsp;takes considerable time (e.g., more than 1 second) to reflect user action (e.g., showing button click lags the click itself, characters show up more than 1 second after typing, etc.) and/or more than 8 seconds to respond to user action (e.g., from submit to data response) and there is no feedback to the user that it is in process.</p> \n<p>&nbsp;</p> \n<div class=\"wiki-content\"> \n <p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Does the UI load/initialize in a reasonable time?</p> \n <p>&nbsp;</p> \n <p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: This question focused on the initial loading time of the UI (whether thin or thick client, or widget). Frequently, a user interface needs to instantiate itself on the client machine (think client) or in the client browser (thin client or web widget) followed by necessary initialization (e.g. loading reference data sets, loading the initial map). Pre-loading lots of data may help expedite subsequent operations, yet may come at the expense of a long waiting period upfront. A good design practice is \"lazy initialization\", i.e. load data items only when they are used for the first time, which reduces the initial loading time and a better user experience.&nbsp; Additionally, the UI \"footprint\" should be minimized (e.g., by \"minifying\" javascript code).</p> \n <p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n <p>The scoring criterion is based on how long the UI initializes itself:</p> \n <p>&nbsp;<strong>Example best answer</strong>: UI take less than 3 seconds to load/initialize</p> \n <p>&nbsp;<strong>Example good answer</strong>: &nbsp;UI takes between 3-8 seconds to load/initialize</p> \n <p>&nbsp;<strong>Example bad answer</strong>: UI takes more than 8 seconds to load/initialize</p> \n <p>&nbsp;</p> \n <p>Not applicable if asset does not include a UI</p> \n <p>&nbsp;</p> \n <p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Does the asset perform its functions in reasonable and expected response times?</p> \n <p>&nbsp;</p> \n <p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: This questions are intended for \"back-end\" components such as an enterprise service (accessible over the network) or a redeployed capability (a local instantiation within the system/program of record). The \"reasonable\" response times will vary from asset to asset.&nbsp; For example, for a Security Token Service provided by an enterprise or an enclave, a 1/2 second response time would be considered unacceptably long, whereas a one-second response for a Web Map Service may be considered fast. Nonetheless, there are reference points that may be used to judge the asset's performance. The scoring criterion of this question use the following as the basis of judging the responsiveness of the service component:</p> \n <ul> \n  <li>When available, use the performance requirements to which an asset has been designed and implemented. For components implemented for a program of record, for instance, there may be Key Performance Parameters (KPP), Key System Attributes (KSA), and other requirements that apply.</li> \n  <li>When defined, use the Quality of Service (QoS) and/or Service Level Agreements (SLAs) that apply for the asset.</li> \n  <li>Where applicable, established performance benchmarking software may be used for evaluation.</li> \n  <li>If available, a well-known component that provides equivalent functionality may be used as a benchmark to evaluate the asset of interest.&nbsp;</li> \n </ul> \n <p>When none of the above is available, subject expert opinion may be sought during evaluation.</p> \n <p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n <p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>:&nbsp;The asset exceeds applicable performance requirements and/or&nbsp;agreed-upon QoS/SLA levels,&nbsp;excels in applicable benchmarking tests,&nbsp;or performs better than well-known products providing equivalent functionality.&nbsp;(e.g., the ephemeris service produces tracks in XX milliseconds, exceeding the designed requirements).</p> \n <p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>:&nbsp;The asset meets applicable performance requirements and/or&nbsp;agreed-upon QoS/SLA levels, passes applicable benchmarking tests, or performs comparably with well-known products providing equivalent functionality.&nbsp;(e.g., the messaging service performs comparatively with the IBM MQSeries in similar use cases).</p> \n <p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: The asset fails to meet&nbsp;applicable performance requirements and/or&nbsp;agreed-upon QoS/SLA levels, fares poorly in applicable benchmarking tests, cannot match well-known products providing equivalent functionality, OR is otherwise considered falling short of the expected response times by a wide margin.&nbsp; (e.g., the federated search service returns the consolidated results in 60 seconds or longer for certain searches, far longer than the SLA-specified 10-second response time).</p> \n</div>","objective":"<p>In general, user interfaces (UI) should react 'immediately' to user input. The reaction may be the intended result that the user is looking for, or may be in the form of an hourglass or other feedback indicating that the \"system\" is working and the user will need to wait for the results. As a rule of thumb, feedback to user actions should be provided within 2 seconds.</p> \n<p>See&nbsp;<a href=\"http://www.perftestplus.com/resources/how_fast.pdf\" rel=\"nofollow\">http://www.perftestplus.com/resources/how_fast.pdf</a>,&nbsp;<a href=\"http://www.webperformancematters.com/journal/2007/7/10/acceptable-response-times.html\" rel=\"nofollow\">http://www.webperformancematters.com/journal/2007/7/10/acceptable-response-times.html</a>, and&nbsp;<a href=\"http://www.nngroup.com/articles/response-times-3-important-limits/\" rel=\"nofollow\">http://www.nngroup.com/articles/response-times-3-important-limits/</a>&nbsp;for information on response times</p>","qid":"200","question":"<p>How well is the asset tested for performance measures?</p> \n<p>Please select which of the below applies to your asset:</p> \n<ul> \n <li>Asset is fully instrumented and tuned for optimal performance as shown in provided documentation</li> \n</ul> \n<ul> \n <li> \n  <ul> \n   <li>Please describe how the asset is instrumented and what tuning took place to optimize performance.</li> \n  </ul> </li> \n</ul> \n<ul> \n <li>Asset measured against performance benchmarks and/or against competing or similar assets</li> \n</ul> \n<ul> \n <li> \n  <ul> \n   <li>Please provide the benchmark results, and/or the results of the comparison</li> \n  </ul> </li> \n</ul> \n<ul> \n <li>Asset performance has been measured, but not compared to any other products or benchmarks</li> \n</ul> \n<ul> \n <li> \n  <ul> \n   <li>Please provide details</li> \n  </ul> </li> \n</ul> \n<ul> \n <li>No specific performance data is provided, but asset has been used in multiple operational systems</li> \n</ul> \n<ul> \n <li> \n  <ul> \n   <li>Please list the operational systems</li> \n  </ul> </li> \n</ul> \n<ul> \n <li>No performance data provided</li> \n</ul>","questionId":"480966ba-9eea-4d11-b1e5-e01284ebf3ac","scoreCriteria":"<p>Performance is scored either on the documentation provided,&nbsp;<strong>or</strong>&nbsp;on benchmark testing.</p> \n<p><strong>Asset is fully instrumented and tuned for optimal performance as shown in provided documentation</strong></p> \n<p>Documentation clearly identifies how the asset is instrumented and what tuning took place to optimize performance&nbsp;<strong>5</strong></p> \n<p>Documentation either only partially describes how asset was instrumented and/or what tuning took place, or indicates that instrumentation was done but tuning was not accomplished<strong>&nbsp;3</strong></p> \n<p>Documentation shows a lack of understanding of instrumentation or tuning<strong>&nbsp;1</strong></p> \n<p><strong>OR</strong></p> \n<p><strong>Asset measured against performance benchmarks and/or against competing or similar assets</strong></p> \n<p>Measurements are provided along with constraints for how the comparison testing was accomplished and/or how the benchmark testing was conducted&nbsp;<strong>5</strong></p> \n<p>Measurements are provided along with constraints for taking those measurements, but no similar measures are provided for competing assets - or benchmark only belongs to the asset owner (i.e., is not defined by a 3rd party)&nbsp;<strong>3</strong></p> \n<p>No actual measurements provided<strong>&nbsp;1</strong></p> \n<p><strong>Add the number to the right of the appropriate section above. Only use one of the two methods above.</strong></p>","evaluationSectionDescription":"Performance"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.238Z","createUser":"rex.nethercott","updateDts":"2017-10-11T21:00:47.342Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"f3c960da-fa5e-4520-8573-3b931f8da186","response":"<p>Not applicable. This asset is \"distributed\" across clusters. It is already given a space in which to work.</p> \n<p>In other words scaling is implemented by the end user.</p>","responseId":"02b41fca-fc2c-4059-9887-598bc23eb6e3","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:23:41.694Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T16:23:41.694Z","updateUser":"devin.shurtleff","evaluationSection":"SC","narrative":"<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Is the asset designed to maintain its performance levels under varying amounts of user requests and/or data?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: In many cases, an asset (either an enterprise service or a redeployed capability)'s performance is directly impacted by the level of demand, in terms of the number of concurrent user requests and/or the volume of data. A well-designed service should be capable of maintaining performance levels even under heavy load. This may be achieved through adequate resource allocation (e.g. server clusters), load monitoring and balancing, and (in cloud environments) elastic resource provisioning. Even under limited resource allocations, the asset should ideally be cognizant of its performance limitations and manage consumers expectations (e.g. stop receiving further requests until the situation improves and provide a meaningful message - analogous to putting a customer service phone call on hold and advise the estimated wait time).</p> \n<p>See&nbsp;<a href=\"http://www.perftestplus.com/resources/how_fast.pdf\" rel=\"nofollow\">http://www.perftestplus.com/resources/how_fast.pdf</a>,&nbsp;<a href=\"http://www.webperformancematters.com/journal/2007/7/10/acceptable-response-times.html\" rel=\"nofollow\">http://www.webperformancematters.com/journal/2007/7/10/acceptable-response-times.html</a>, and&nbsp;<a href=\"http://www.nngroup.com/articles/response-times-3-important-limits/\" rel=\"nofollow\">http://www.nngroup.com/articles/response-times-3-important-limits/</a>&nbsp;for information on response times</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>:&nbsp;The asset's configuration allows auto-scaling with use and, when so configured, there is no discernible difference with increasing connections and increased data accessed per connection&nbsp;(e.g., the asset employs a software load-balancer component and virtualized processing and data-layer components that can be dynamically provisioned, allowing linear scalability).</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>:&nbsp;The asset's configuration allows&nbsp;throttling of service requests and, when so configured,&nbsp;response times are consistent, but throttling limits the number of connections / users supported - OR - the asset's configuration allows&nbsp;scaling on one dimension (e.g., number of users) but not on other dimensions, such as the amount of data requested&nbsp;(e.g., the asset receives requests from a message queue with a fixed size, and surge requests will wait until the queue is not full - OR - the asset deploys in a JBoss server under a clustering configuration, but all JBoss instances point to a single database, limiting its scalability).</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: The asset's configuration&nbsp;does not allow auto-scaling or throttling of service requests, and service response times vary widely due to usage (e.g., the asset has no request management functionality and has a singleton component that becomes a bottleneck for scalability).</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Are the asset's resource requirements well understood?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: In order to operate a system the physical resource requirements should be well known. For a well designed scalable component (<a href=\"https://confluence.di2e.net/display/DFPL/Narrative+610\" rel=\"nofollow\">Question #610</a>&nbsp;focuses on this) it is very useful to understand the resource requirements based upon workload. For example, if it is known that a component running on a VM with 4 cores and 16G of memory can process 200 simultaneous user requests then it is reasonable to appropriately design a system based upon expected workloads. This information can be determined via load/performance testing, which should be well documented and described.&nbsp;</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example best answer</strong></span>: The asset has well documented resource requirements based upon expected workloads and the resource requirements are expressed in terms of commodity hardware resources. Load testing test plans and test results are included with the documentation.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example good answer</strong></span>: The asset has general performance information based upon workload in its documentation but it is not specific and not verified by test results. The resource requirements are based upon experience with an operational instance.</p> \n<p><span style=\"text-decoration: underline;\"><strong>Example bad answer</strong></span>: No information is available on resource requirements based upon workload OR the resource needs are tied to specific proprietary hardware / systems</p>","objective":"<p>This question helps to understand how the asset supports scaling to larger workloads, numbers of users, etc.</p>","qid":"210","question":"<p>How scalable is the asset?</p> \n<p>Note: This question is intended for \"back-end\" components such as an enterprise service (accessible over the network) or a redeployed capability (a local instantiation within the system/program of record).&nbsp;</p> \n<p>Please identify which of the below applies to your asset:</p> \n<ul> \n <li>The asset auto-scales by measuring its own performance and&nbsp;<em>automatically</em>&nbsp;creating additional instances of the asset on additional CPUs (i.e., automated horizontal scaling)</li> \n <li>The asset scales by&nbsp;<em>manually</em>&nbsp;creating additional instances of the asset on additional CPUs (i.e., manual horizontal scaling)</li> \n <li>The asset measures its own performance and&nbsp;<em>automatically</em>starts additional worker threads on a single CPU,&nbsp;but does not support multiple instances in parallel&nbsp;(i.e., vertical scaling)</li> \n <li>The asset uses worker threads, but they are set at startup via system configuration or are hard-coded (i.e., vertical scaling)</li> \n <li>The asset maintains performance levels by limiting the number of connections, users, or amount of data provided per request</li> \n <li>Scaling is not explicitly built into the asset</li> \n <li>N/A</li> \n</ul>","questionId":"f3c960da-fa5e-4520-8573-3b931f8da186","scoreCriteria":"<p>The asset auto-scales by measuring its own performance and&nbsp;<em>automatically</em>&nbsp;creating additional instances of the asset on additional CPUs (i.e., automated horizontal scaling)&nbsp;<strong>5</strong></p> \n<p>The asset measures its own performance and&nbsp;<em>automatically</em>&nbsp;starts additional worker threads on a single CPU, but does not support multiple instances in parallel (i.e., vertical scaling)&nbsp;<strong>4</strong></p> \n<p>The asset scales by&nbsp;<em>manually</em>&nbsp;creating additional instances of the asset on additional CPUs (i.e., manual horizontal scaling)&nbsp;<strong>3</strong></p> \n<p>The asset uses worker threads, but they are set at startup via system configuration or are hard-coded (i.e., vertical scaling)&nbsp;<strong>3</strong></p> \n<p>The asset maintains performance levels by limiting the number of connections, users, or amount of data provided per request&nbsp;<strong>2</strong></p> \n<p>Scaling is not explicitly built into the asset&nbsp;<strong>1</strong></p> \n<p>N/A</p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Scalability"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.239Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:14:53.579Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"ecf3d9da-8ac6-4a4f-8374-7697853d4fa3","response":"<p>No specific static or dynamic analysis tools are applied&nbsp;<strong>Score = 1</strong></p>","responseId":"febfebde-1c8d-4027-9133-53f95b6a1900","score":1,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:30:52.516Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T16:30:52.516Z","updateUser":"devin.shurtleff","evaluationSection":"SEC","narrative":"<p>This question is looking for whether the asset owner employs code security analysis tools as a regular part of the development phase of their software development lifecycle (SDLC). There is no way to guarantee the absence of vulnerabilities, but there are well-known ways to minimize the risk, or likelihood, of such vulnerabilities. These include leveraging a continuous integration (CI) development process that employs the automated running of both static code analysis tools (e.g., HP Fortify) and dynamic code analysis tools (e.g., Metasploit).&nbsp; Note that many of the static code analysis tools generate false positives, so that just because a tool report shows, for example, a CAT 1 finding, it is important to follow that up with a manual review to validate that the CAT 1 finding is, in fact, NOT a false positive. This is why leveraging these tools during the SDLC is most effective - because feedback to the development team is regular and (almost) immediate - lowering the overall effort and cost to evaluate and address them. &nbsp;If the analysis tools are only employed at the end of development, the cost to address any findings is much higher - which will generally result in only the most critical findings being addressed. &nbsp;</p> \n<p>It is also worth noting that static code analysis tools can only catch certain kinds of vulnerabilities (see&nbsp;<a href=\"https://www.owasp.org/index.php/Source_Code_Analysis_Tools\" rel=\"nofollow\">write up on OWASP on SCA tools</a>), and that dynamic code analysis tools are also required to get a more complete coverage of the asset. &nbsp;&nbsp; &nbsp;</p> \n<p>It should also be noted that the whole SDLC encompasses the initial design - but the tools and evidence that we are looking for in this question are only used during the actual development phase of the SDLC</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS - although for COTS and GOSS where source code is not available, the answer to this question should be based on interviews with the asset owner and some evidence of both security code review as well as static code analysis reports. &nbsp;If asset owner is not able to show any evidence of static code analysis and/or security code reviews, then that should be noted and a lower score given (e.g., a 1 or a 2)</p> \n<p><strong>Example best answer</strong>: &nbsp;Asset source code is regularly run against static and dynamic&nbsp;source code&nbsp;analysis tools (e.g., HP Fortify and KALI Linux tools applied in Continuous Integration process) and findings are addressed immediately as part of the regular SDLC</p> \n<p><strong>Example good answer</strong>:&nbsp;Asset source code is&nbsp;<em>sometimes</em>&nbsp;run against static and dynamic&nbsp;source code&nbsp;analysis tools (e.g., waterfall based SDLC) - OR - asset source code is regularly run against&nbsp;<em>either</em>&nbsp;static&nbsp;<em>or</em>&nbsp;dynamic source code analysis tools - AND - findings are addressed as part of the regular SDLC</p> \n<p><strong>Example bad answer</strong>:&nbsp;Asset source code is run against static or dynamic source code analysis tools but findings are NOT fed back into the SDLC for remediation - OR - the asset has not been&nbsp;run against any static or dynamic source code analysis tools or gone through formal code review</p>","objective":"<p>Do the asset owners employ code security analysis tools as a regular part of the development phase of their Software Development Life Cycle (SDLC)? There is no way to guarantee the absence of vulnerabilities, but there are well-known ways to minimize the risk or likelihood of such vulnerabilities. These include leveraging a continuous integration (CI) development process that employs the automated running of both static (e.g., HP Fortify) and dynamic (e.g., Metasploit) code analysis tools.</p>","qid":"220","question":"<p>How was is the source code tested for security vulnerabilities?</p> \n<p>Please describe the code security analysis performed and provide results.</p> \n<p>Please identify which of the following processes to minimize the likelihood of critical security vulnerabilities are applicable to your asset:</p> \n<ul> \n <li>Asset source code is evaluated by multiple static analysis tools</li> \n <li>Asset source code is evaluated by a single static analysis tool</li> \n <li>Asset code is evaluated by multiple dynamic source code analysis tools</li> \n <li>Asset code is evaluated by a single dynamic source code analysis tool</li> \n <li>Static and/or dynamic analysis findings MUST be addressed before code is checked in</li> \n <li>Static and/or dynamic analysis findings are entered as issues to be addressed in later sprints or releases</li> \n <li>Static and/or dynamic analysis findings are not formally tracked</li> \n <li>No specific static or dynamic analysis tools are applied</li> \n</ul> \n<p>For cases where static or dynamic analysis tools are used, please identify the tools used</p>","questionId":"ecf3d9da-8ac6-4a4f-8374-7697853d4fa3","scoreCriteria":"<div class=\"table-wrap\">\n  Asset source code is evaluated by multiple static analysis tools&nbsp; \n <strong>+2</strong> \n</div> \n<p>Asset source code is evaluated by a single static analysis tool&nbsp;<strong>+1</strong></p> \n<p>Asset code is evaluated by multiple dynamic source code analysis tools&nbsp;<strong>+2</strong></p> \n<p>Asset code is evaluated by a single dynamic source code analysis tool&nbsp;<strong>+1</strong></p> \n<p>Static and/or dynamic analysis findings MUST be addressed before code is checked in&nbsp;<strong>+2</strong></p> \n<p>Static and/or dynamic analysis findings are entered as issues to be addressed in later sprints or releases&nbsp;<strong>+1</strong></p> \n<p>Static and/or dynamic analysis findings are not formally tracked&nbsp;<strong>-1</strong></p> \n<p>Results of code analysis is not provided&nbsp;<strong>-1</strong></p> \n<p>No specific static or dynamic analysis tools are applied&nbsp;<strong>Score = 1</strong></p> \n<p>&nbsp;</p> \n<p><strong><strong>Add the numbers to the right of each item above.</strong></strong></p> \n<p><strong>5</strong>&nbsp;= 6 or more points<br><strong>4</strong>&nbsp;= 4-5 points&nbsp;<br><strong>3</strong>&nbsp;= 3 points<br><strong>2</strong>&nbsp;= 2 points<br><strong>1</strong>&nbsp;or less = 1 point</p>","evaluationSectionDescription":"Security"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.241Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:16:41.506Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","notApplicable":true,"privateNote":"","questionId":"42050628-d62a-4264-876e-76489321fb2a","response":"<p>Not applicable, You don't \"sign-on\" to apex.</p>","responseId":"8535ffbd-b897-4ae9-b8b0-7ff59b270c1e","workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:32:07.205Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T16:32:07.205Z","updateUser":"devin.shurtleff","evaluationSection":"SEC","narrative":"<p>This question is concerned with the application level security of the asset, i.e. the authentication, authorization, policy enforcement, auditing, etc. that is separate from the Mandatory Access Control (MAC) enforced by the residing network environment. Under normal circumstances, an asset should lend itself to be protected by an existing enterprise Identity and Access Management (IdAM) solution.&nbsp; A web service, for example, should be transparently protected by a PEP and/or container-level security. That said, in some cases the asset may be a framework or a packaged solution that comes with its own IdAM implementation. In the latter case, the asset's IdAM functions should federate and interoperate seamlessly with the existing enterprise solution.</p> \n<p>Additionally, an asset may need to enforce finer-grained access control policies (e.g. filtering search results by the user's roles and the dissemination control and releaseabilty attributes of result documents). Ideally, such access controls should be enabled by dynamic consumption of identity/resource/environment attributes and RBAC/ABAC policies&nbsp;propagated by the enterprise IdAM solution.&nbsp;</p> \n<p>This intent of this question is also to discourage home-grown and/or proprietary IdAM solutions that make take a significant engineering effort to integrate with an existing IdAM solution. In such cases an asset should receive a low score.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>:&nbsp; The asset seamlessly or easily integrates with existing external enterprise IdAM solutions</p> \n<p><strong>Example good answer</strong>: The asset integrates with existing external enterprise IdAM solutions with some manual configurations and/or minimal glue code.</p> \n<p><strong>Example bad answer</strong>: The asset does not integrate with existing external enterprise IdAM solutions without significant engineering effort.</p>","objective":"<p>This question helps identify whether the asset is coupled to a specific IdAM framework, or whether it can integrate with different enterprise-grade Identity and Access Management (IdAM) solutions for end-user or consuming application authentication and authorization<span style=\"text-decoration: underline;\"><strong>.</strong></span></p>","qid":"230","question":"<p>How well can the asset integrate into existing authentication and authorization capabilities?</p> \n<p>Please choose all the following that apply to your asset concerning authentication:</p> \n<ul> \n <li>Uses embedded file-based or proprietary solution for authentication and authorization</li> \n <li>Uses embedded LDAP for authentication and authorization</li> \n <li>Can integrate with external LDAP for authentication and authorization</li> \n <li>Can integrate with external SSO solution for authentication and uses roles for authorization</li> \n <li>Can integrate with external SSO solution for authentication and external Access Management solution for authorization</li> \n</ul>","questionId":"42050628-d62a-4264-876e-76489321fb2a","scoreCriteria":"<p>Can integrate with external SSO solution for authentication and external Access Management solution for authorization&nbsp;<strong>5</strong></p> \n<p>Can integrate with external SSO solution for authentication and uses roles for authorization&nbsp;<strong>4</strong></p> \n<p>Can integrate with external LDAP for authentication and authorization&nbsp;<strong>3</strong></p> \n<p>Uses embedded LDAP for authentication and authorization&nbsp;<strong>2</strong></p> \n<p>Uses embedded file-based or proprietary solution for authentication and authorization&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Security"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.242Z","createUser":"rex.nethercott","updateDts":"2017-10-11T21:02:31.897Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"388380e3-a2ab-45db-b955-f986a83fd607","response":"<p>Upgrade process is unknown. An upgrade could be performed by removing the old service and installing a new one but that would result is a period of no service.</p>","responseId":"2facd59f-4fd3-41d5-9501-9740fcdf880d","score":1,"workflowStatus":"COMPLETE","question":{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:38:00.203Z","createUser":"devin.shurtleff","updateDts":"2017-08-28T15:23:38.849Z","updateUser":"devin.shurtleff","evaluationSection":"MAIN","narrative":"<p>Upgrading the asset should require minimal effort from the consumer.&nbsp; Examples of this include a smart installer such as an MSI wizard or yum is provided to automate upgrade procedure OR upgrading the asset only requires overwriting an existing jar file with the newer jar file.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>:&nbsp; Yes.&nbsp; Backward compatibility is maintained for APIs, data formats and configurations. Copy/deploy a single archive file and the upgrade is done.&nbsp; No updates to dependencies are required.&nbsp; Alternatively, Installer will upgrade an existing installation with minimal user interaction, resulting in a fully working upgraded system (e.g., any platform or dependencies updates are performed automatically).</p> \n<p><strong>Example good answer</strong>: New version requires some re-work of the integration.&nbsp; (e.g. APIs are stable, but config files are not). Platform upgrades or dependencies are necessary and manual, but are minimal and/or well documented. If an installer is used, it upgrades an existing installation but require some manual changes which are well documented.</p> \n<p><strong>Example bad answer</strong>: No.&nbsp; New version requires major re-work of the integration. Requires a platform upgrade (new version of Java, Ruby, Node, etc), little or no documentation for this process.&nbsp; If automated, requires un-installation and re-installation, without preserving data from previous installation, requiring manual changes, such as removing or updating registry entries.&nbsp; Requires manual recompile.&nbsp; Breaks other applications.</p>","objective":"","qid":"250","question":"<p>How backward comparable is the asset?</p> \n<p>Please describe how new versions of the asset delivered and packaged so they can be easily upgraded to existing installations</p>","questionId":"388380e3-a2ab-45db-b955-f986a83fd607","scoreCriteria":"<p>Backward compatibility is maintained for APIs, data formats and configurations. Copy/deploy a single archive file and the upgrade is done.&nbsp; No updates to dependencies are required.&nbsp; Alternatively, Installer will upgrade an existing installation with minimal user interaction, resulting in a fully working upgraded system (e.g., any platform or dependencies updates are performed automatically).&nbsp;<strong>5</strong></p> \n<p>New version requires some re-work of the integration.&nbsp; (e.g. APIs are stable, but config files are not). Platform upgrades or dependencies are necessary and manual, but are minimal and/or well documented. If an installer is used, it upgrades an existing installation but require some manual changes which are well documented.&nbsp;<strong>3</strong></p> \n<p>No.&nbsp; New version requires major re-work of the integration. Requires a platform upgrade (new version of Java, Ruby, Node, etc), little or no documentation for this process.&nbsp; If automated, requires un-installation and re-installation, without preserving data from previous installation, requiring manual changes, such as removing or updating registry entries.&nbsp; Requires manual recompile.&nbsp; Breaks other applications.&nbsp;<strong>1</strong></p>","evaluationSectionDescription":"Maintainability"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.244Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:33:15.365Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"5d0a59eb-14bc-489d-a9ae-f44bd667ec43","response":"<p>There exists a community open forum&nbsp;<strong>+1</strong></p>","responseId":"5c8d0584-92d1-4958-9bb8-01569218c992","score":1,"workflowStatus":"COMPLETE","question":{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:40:06.128Z","createUser":"devin.shurtleff","updateDts":"2017-10-09T21:24:08.531Z","updateUser":"rex.nethercott","evaluationSection":"COM","narrative":"<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Are there mechanisms to capture and track consumer feedback?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: Once an asset is offered to the larger community, the asset provider should provide mechanisms to formally and regularly seek consumer feedback. This is especially important for shared services or common components that have a large consumer base. By soliciting consumer feedback, defects can be identified and mitigated early before impacting the community at large, and future requirements can be accurately prioritized to make sure engineering efforts get better \"bang for the buck\". These mechanisms might include the following:</p> \n<ul> \n <li>Change request and bug tracking processes</li> \n <li>Online portals</li> \n <li>Discussion forums</li> \n <li>Social media</li> \n <li>Technical exchange meetings (TEM), held regularly with user representatives</li> \n <li>Helpdesk and technical support channels</li> \n</ul> \n<p>Having open channels to receive consumer feedback is just the starting point. Consumer requests should be acknowledged in a timely manner and tracked to completion, with appropriate actions taken (e.g. CR submitted to address a defect, new requirement entered into feature backlog, etc.)</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>: Formal mechanism provided for consumer feedback.&nbsp; Multiple online venues exist to solicit feedback.&nbsp; Feedback formally tracked to completion (or rejection).Consumer Feedback actively solicited (e.g., PoR holds periodic&nbsp;TEMs with the user community, etc.)</p> \n<p><strong>Example good answer</strong>: Reactive response, but no active solicitation of consumer feedback (e.g. help desk and technical support POCs are offered and responsive to customer requests)</p> \n<p><strong>Example bad answer</strong>: No mechanism in place to capture consumer feedback; or support POCs exist, but are not responsive.</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Is there an active community of users and/or developers?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>:&nbsp;An asset should foster an open, active community for the consumers (end users, developers, or other interested party) to freely collaborate and share information. The community serves a dual purpose: it not only helps the asset owner \"feel the pulse\" of its user base and gain awareness on how the asset is being used, but also gives the user community a venue to network among themselves and help one another. The community can provide a wealth of information that the asset provider can \"mine\" to continually improve the asset's functionality and quality. As a simple example, by tracking user growth&nbsp;in various organizations / mission areas&nbsp;and the \"tag cloud\" of hot topics in user discussion forums, the the asset provider can identify trends and patterns that better informs the future budget process and proactively allocate resources.</p> \n<p>There can be multiple venues for community outreach as mentioned in&nbsp;<a href=\"https://confluence.di2e.net/display/DFPL/Narrative+800\" rel=\"nofollow\">Question #800</a>, but the most effective way is to have an openly accessible online presence (e.g. a wiki site), augmented by social media when possible. The effectiveness of the venues can be best judged by the active participation of the users and developers.</p> \n<p>For open source assets, it is even more critical that an active community of developers exists in order to ensure that the asset will continue to mature.&nbsp; Note that question&nbsp;<a href=\"https://confluence.di2e.net/display/DFPL/Narrative+860\" rel=\"nofollow\">#860&nbsp;&nbsp;</a>gets at the additional venues such as GitHub or the DI2E Developer Tools that are necessary to collaborate on code development, this question is looking at whether such an active community exists.&nbsp; If there is no active community of either users or developers, that would imply that the asset is in danger of getting \"stale\", and increases the risk of another program re-using this asset if they don't also provide developers to maintain it.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS - although for COTS and GOTS where source code is not available this might be limited to an active community providing feedback and helping other implementers of the asset.</p> \n<p><strong>Example best answer</strong>: Yes, many users and developers are actively participating in the asset lifecycle as can be seen by looking at online developer Wiki and seeing daily / weekly posts from various participants.</p> \n<p><strong>Example good answer</strong>: Yes, some users and/or developers are participating in the asset lifecycle, but they are not very active as can be seen by, for example, an Intelink community page used for collaboration with few participants and infrequent (quarterly or less) updates</p> \n<p><strong>Example bad answer</strong>: No. The asset provider does not track the users and/or developers using this asset or promote their collaboration, or if they do there is no evidence of any developers/users participating.</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Does the community provide independent information on the usage of the asset?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: The intent of this question is to ascertain whether there is a free flow of information about this asset between users and other stakeholders of the asset or whether all information about the asset is only from the asset owner. As mentioned in&nbsp;<a href=\"https://confluence.di2e.net/display/DFPL/Narrative+910\" rel=\"nofollow\">Question #910</a>, an asset should foster an open, active community of developers and users (i.e., the consumers, end users, developers, or other interested parties).&nbsp; This question gets at whether that community can freely collaborate and share information. This community serves a dual purpose: it not only helps the asset owner \"feel the pulse\" of its user base and gain awareness on how the asset is being used, but also gives the user community a venue to network among themselves and help one another.&nbsp;Information and experience sharing among consumers often leads to more efficient support and even better insights on the asset than one-way information from the asset provider alone. For example, a new user may need to wait for a day or two to get a response to a simple question from the official technical support POC, but posting the question to the community may generate multiple answers in a matter of minutes.</p> \n<p>It may be uncomfortable and sometimes takes a mindset change on the asset provider's part to allow for independent, \"unofficial\" information on the usage of the asset, among the user community. However, the benefits of having a thriving, collaborating community that supports one another will by far outweigh any concerns of \"losing control\".</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>: Yes, and there is an open, free flow of a breadth of information amongs all stakeholders through multiple channels, and stakeholders can find useful information about the asset in addition to that is offered by the asset provider.&nbsp; E.g., online developer Wiki is openly accessible; consumers can find useful information about the asset in addition to what is offered by the asset provider.</p> \n<p><strong>Example good answer</strong>:&nbsp;Yes, there is some flow of information through limited channel(s) such as a user forum, a mailing list, or document sharing, etc.&nbsp; Some useful information can be found beyond what the asset provider has already provided. E.g., Intelink community page exists that requires CAC access;</p> \n<p><strong>Example bad answer</strong>: No, there is no independent information offered by the stakeholders beyond what is already offered by the asset provider.&nbsp; No collaborative venue exists for the stakeholders.</p>","objective":"<p>This question helps identify how consumers of the asset can provide feedback to the asset owner, as well as how consumer feedback is addressed (tracked to completion or rejection). Feedback might be for new features, improving existing features, bugs, etc.</p> \n<p>Mechanisms to capture consumer feedback include online forums, periodic user forums/technical exchange meetings (TEM), helpdesk, technical support POC info, website for customer input, etc.</p>","qid":"260","question":"<p>How easy is it for a customer to provide feedback on the asset?</p> \n<p>Please describe how feedback is handled.</p> \n<p>Please describe the community interactions.</p> \n<p>&nbsp;</p>","questionId":"5d0a59eb-14bc-489d-a9ae-f44bd667ec43","scoreCriteria":"<div class=\"table-wrap\">\n  &nbsp; \n</div> \n<p>User feedback is easily provided to the asset provider&nbsp;<strong>+1</strong></p> \n<p>There exists a community open forum&nbsp;<strong>+1</strong></p> \n<p>Asset provider actively responds to feedback in the community&nbsp;<strong>+1</strong></p> \n<p>Content and responses timely to users needs&nbsp;<strong>+1</strong></p> \n<p>There exists a way to directly contact the asset provider&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p><strong>Add the numbers to the right of each item above</strong></p>","evaluationSectionDescription":"Community"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.245Z","createUser":"rex.nethercott","updateDts":"2017-10-25T13:55:33.755Z","updateUser":"stan.burlingame","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"88dfced2-d3b9-4edc-a9e8-af34c3b7e4aa","response":"<p>S/W versioning strategy/scheme appears to exist, but is not documented or is poorly implemented&nbsp;<strong>2</strong></p>","responseId":"9d93309e-d7ff-43d0-ae74-4a18674248cf","score":2,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T16:41:28.136Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T16:41:28.136Z","updateUser":"devin.shurtleff","evaluationSection":"CM","narrative":"<p>To support the enhancement and evolution of its implementations, an asset should define and execute a versioning strategy that involves consistent and meaningful versioning schemes, versioning documentation, mechanisms for version discovery, and careful considerations for backward-compatibility. Such a strategy gives consumers the ability to adapt to a new version or provide meaningful feedback&nbsp;describing the incompatibility or difference.&nbsp;In the best case scenario, the asset's versioning strategy should achieve the following:</p> \n<ul> \n <li>The versioning scheme is consistent, easy to understand, and predictable</li> \n <li>The versioning scheme indicates backward compatibility, e.g. using major and minor version numbers</li> \n <li>Version information is clearly displayed in user interfaces, e.g.&nbsp;in an application title bar, through an about box, etc.</li> \n <li>Asset documentation clearly reflects versioning and version-specific data (e.g. via a VDD document).</li> \n <li>Version information is included in discovery metadata about the asset.</li> \n</ul> \n<p>In the worst case, an asset has no meaningful versioning strategy to speak of, and version information is either lacking, inconsistent, or not discoverable.</p> \n<p>There are additional considerations for the versioning strategy to cover as well:</p> \n<ul> \n <li>Any changes should minimize impacts to the consumer</li> \n <li>When non-backwards compatible changes have to be made, they should be obvious and easily discoverable&nbsp;</li> \n <li>When a new non-backwards compatible version is created, support for the older version should be maintained for a reasonable period of time and old versions should still be available while supported</li> \n <li>A version roadmap should exist that describes how long versions will be supported and when versions are expected to be deprecated</li> \n</ul> \n<p>Clients are able to adapt to the new version or provide meaningful feedback describing the incompatibility or difference;&nbsp;major and minor versions are easily recognizable through the versioning scheme;&nbsp;software version is displayed in an application title bar, through an about box, or similarly familiar user expectation; for a widget the version is recognizable through the download link/folder name, and/or documentation is clearly marked; for an Enterprise Service asset (e.g., web service) has to come from its service documentation such as an Interface Description Document (WSDL, WADL) or version is specified in the URL.</p> \n<p>See&nbsp;<a href=\"http://semver.org/\" rel=\"nofollow\">http://semver.org/</a>&nbsp;or&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/ff384251.aspx\" rel=\"nofollow\">http://msdn.microsoft.com/en-us/library/ff384251.aspx</a>&nbsp;for more info on versioning strategies</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>: The asset follows a versioning strategy that&nbsp;is well-defined and predictable (e.g.&nbsp;there is a versioning scheme included in file format, network protocols, etc.; major and minor versions are easily recognizable through the versioning scheme; current version of the running software can be easily determined via the \"about\" dialog, and so on.).&nbsp;</p> \n<p><strong>Example good answer</strong>: A coherent and predictable versioning strategy is not defined, but the asset's history shows adherence to some of the versioning tenets and best practices.&nbsp;&nbsp;</p> \n<p><strong>Example bad answer</strong>:&nbsp;No versioning scheme is defined, or there exists evidence that shows the asset does not follow (or explicitly violates) versioning tenets and best practices.</p>","objective":"<p>For this question, we are looking for a versioning strategy that is well-defined and predictable, and a clear definition of the versioning scheme.</p> \n<p>An example of a versioning strategy is the following:</p> \n<p>Deploy a new version every 3 months, ensure backwards compatibility with previous two versions, and if a non-backwards compatible API update needs to be made, the old API will be kept for at least one year.</p> \n<p>An example numbering scheme is the following:</p> \n<ol> \n <li>major.minor.patch \n  <ol> \n   <li>major = non-backwards compatible change</li> \n   <li>minor = backwards compatible enhancement</li> \n   <li>patch = backwards compatible bug fix</li> \n  </ol> </li> \n</ol> \n<p>&nbsp;</p> \n<p>See&nbsp;<a href=\"http://semver.org/\" rel=\"nofollow\">http://semver.org/</a>&nbsp;or&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/ff384251.aspx\" rel=\"nofollow\">http://msdn.microsoft.com/en-us/library/ff384251.aspx</a>&nbsp;or&nbsp;<a href=\"https://en.wikipedia.org/wiki/Software_versioning\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Software_versioning</a>&nbsp;for more info on versioning strategies and schemes</p>","qid":"270","question":"<p>How well documented and presented is the versioning strategy?</p> \n<p>Please identify the versioning strategy, and describe the version naming or numbering scheme, for your asset</p> \n<ul> \n <li>A S/W versioning strategy is well documented, is based on&nbsp;<a href=\"http://semver.org/\" rel=\"nofollow\">Semantic Versioning</a>, and is consistently implemented</li> \n <li>A S/W versioning strategy is documented, is based on \"size\" of change vice backwards compatibility of change, and is consistently implemented</li> \n <li>S/W versioning strategy is documented, but is inconsistently implemented - OR - is not well documented but is consistently implemented</li> \n <li>S/W versioning strategy/scheme appears to exist but is not documented or is poorly implemented</li> \n <li>There doesn't appear to be any explicit S/W versioning strategy or scheme.</li> \n</ul>","questionId":"88dfced2-d3b9-4edc-a9e8-af34c3b7e4aa","scoreCriteria":"<p>A S/W versioning strategy is well documented, is based on&nbsp;<a href=\"http://semver.org/\" rel=\"nofollow\">Semantic Versioning</a>, and is consistently implemented&nbsp;<strong>5</strong></p> \n<p>A S/W versioning strategy is documented, is based on \"size\" of change vice backwards compatibility of change, and is consistently implemented&nbsp;<strong>4</strong></p> \n<p>S/W versioning strategy is documented, but is inconsistently implemented - OR - is not well documented but is consistently implemented&nbsp;<strong>3</strong></p> \n<p>S/W versioning strategy/scheme appears to exist but is not documented or is poorly implemented&nbsp;<strong>2</strong></p> \n<p>There doesn't appear to be any explicit S/W versioning strategy or scheme.&nbsp;<strong>1</strong></p> \n<p>S/W versioning is not publicized +1</p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Change Management"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.246Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:35:28.063Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"a31aa1d3-fd22-4262-9764-516ca19b40fe","response":"<p>Notifications are made on provider's website, but are hard to find&nbsp;<strong>2</strong></p>","responseId":"b65bd26e-cf4b-485a-a4e9-b2de1042c99e","score":2,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-08-03T22:41:53.152Z","createUser":"devin.shurtleff","updateDts":"2017-08-03T22:41:53.152Z","updateUser":"devin.shurtleff","evaluationSection":"CM","narrative":"<div class=\"wiki-content\"> \n <p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Is there a mechanism to manage the discovery and availability of patches?</p> \n <p>&nbsp;</p> \n <p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>: For reployable components such as a service or a widget,&nbsp;mechanisms should be available to notify consumers of upcoming changes to the asset.&nbsp;The changes may include patches and maintenance activities for the current version, sunset / obsolescence of the current version, and arrival of new versions / patches. Ideally, the currently installed component should automatically check for new updates, and patches and other upgrades can be installed automatically to minimize administrative overhead.</p> \n <p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n <p><strong>Example best answer</strong>: Component automatically checks for updates and allows for user configured control on when it is applied.&nbsp; (Config options might be: Auto, Download only, Notify only).</p> \n <p><strong>Example good answer</strong>:&nbsp;Notifies when there is an update, but requires a manual download and installation.&nbsp; Or updates apply automatically without control.</p> \n <p><strong>Example bad answer</strong>:&nbsp;Requires self-discovery to find out if there is something new, when released, is it even different, where to obtain, etc.</p> \n <p>&nbsp;</p> \n <p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Is there a mechanism to manage the discovery and availability of changes to the service?</p> \n <p>&nbsp;</p> \n <p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>:&nbsp;For an enterprise service, mechanisms should be available to notify consumers of upcoming changes to the asset. The changes may include updates and maintenance activities for the current version, sunset / obsolescence of the current version, and arrival of new versions.</p> \n <p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n <p><strong>Example best answer</strong>:&nbsp;Consumers&nbsp;notified via various mechanisms (both push and pull)&nbsp;as far ahead of time as possible.</p> \n <p><strong>Example good answer</strong>:&nbsp;Consumers are notified via a single means of updates, or notifications are provided at the same time as the new service is made available (no forewarning).</p> \n <p><strong>Example bad answer</strong>:&nbsp;Requires self-discovery to find out if there is something new.</p> \n</div> \n<div>\n  &nbsp; \n</div>","objective":"<p>Changes or updates may include patches and maintenance activities for the current version, sunset / obsolescence of a given version, and arrival of new versions / patches. &nbsp;</p>","qid":"275","question":"<p>How well are updates and versions marketed to your customers?</p> \n<p>Please identify all of the below that apply to how you notify existing consumers of new versions, updates, or patches to your asset.</p> \n<ul> \n <li>New version, update or patch happens through an automated software update and download mechanism</li> \n <li>Notifications are pushed to all existing customers via email or other push mechanism (e.g., sales call to license holders, etc.)</li> \n <li>Notifications are made in a prominent place on the provider's website</li> \n <li>Notifications are made on provider's website, but are hard to find</li> \n <li>Customer must contact the asset provider to find out about new updates.</li> \n</ul>","questionId":"a31aa1d3-fd22-4262-9764-516ca19b40fe","scoreCriteria":"<p>New version, update or patch happens through an automated software update and download mechanism&nbsp;<strong>5</strong></p> \n<p>Notifications are pushed to all existing customers via email or other push mechanism (e.g., sales call to license holders, etc.)&nbsp;<strong>4</strong></p> \n<p>Notifications are made in a prominent place on the provider's website&nbsp;<strong>3</strong></p> \n<p>Notifications are made on provider's website, but are hard to find&nbsp;<strong>2</strong></p> \n<p>Customer must contact the asset provider to find out about new updates.&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Change Management"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.248Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:36:21.495Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"f5c1937e-dff4-4f46-a6bd-8eabaa78e77b","response":"<p>Asset source code is available to consumers AND asset architecture enables incorporation of custom modules to extend or change existing functionality AND 3rd party contributions for enhancements and/or bug fixes are permitted&nbsp;<strong>5</strong></p>","responseId":"7d467f1d-62d3-4a90-a2dd-01cc5776ed0a","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T18:57:19.086Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T18:57:19.086Z","updateUser":"devin.shurtleff","evaluationSection":"CM","narrative":"<p>The ability for third parties to contribute to the baseline is a critical success factor for open source components whether GOSS or FOSS. As components are reused in multiple projects it will be critical that all interested parties are able to create patches and enhance capabilities. Ideally, the asset owner should make source code and associated artifacts available to the community (e.g. in a git-like environment) and allow collaborative development. External changes can be checked in, reviewed, and (if found of value) incorporated into the baseline through the change control process.</p> \n<p>Another way that third-party contributions can be made is via plugins or add-ons to the base product. &nbsp;The&nbsp;<a href=\"http://www.atlassian.com/\" rel=\"nofollow\">Atlassian&nbsp;</a>suite of software &nbsp;development support products is a good example of this. &nbsp;Atlassian supports a&nbsp;<a href=\"https://marketplace.atlassian.com/\" rel=\"nofollow\">marketplace&nbsp;</a>for 3rd parties to advertise their add-ons to the various Atlassian products. &nbsp;These add-ons are generally separately licensed, and may be free or may be for a cost.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS. &nbsp;However, COTS and GOTS assets where source code is not made available are expected to score low on this question.&nbsp;</p> \n<p><strong>Example best answer</strong>: The asset source code is maintained in a shared environment (e.g., the DI2E Framework Devtools - including Stash, Subversion, etc.) and collaborative development analogous to typical open source projects occurs.</p> \n<p><strong>Example good answer</strong>:&nbsp;The asset source code is available and the provider will manually work on incorporating external enhancements or patches upon request.</p> \n<p><strong>Example bad answer</strong>:&nbsp;There is no mechanism for external contributions.</p>","objective":"<p>This question is getting at the openness or extensibility of the asset architecture to to enable third parties to contribute to the baseline and to enhance capabilities.</p>","qid":"280","question":"<p>How easily can a customer update the source code or incorporate custom modules?</p> \n<p>Please select which of the following applies to your asset:</p> \n<ul> \n <li>Asset source code is available to consumers AND asset architecture enables incorporation of custom modules to extend or change existing functionality AND 3rd party contributions for enhancements and/or bug fixes are permitted&nbsp;</li> \n <li>Asset source code is available to consumers AND asset architecture enables incorporation of custom modules to extend or change existing functionality OR<strong>&nbsp;</strong>3rd party contributions for enhancements and/or bug fixes are supported</li> \n <li>Asset source code is available to consumers OR asset architecture enables incorporation of custom modules to extend or change existing functionality BUT 3rd party contributions for enhancements and/or bug fixes are NOTsupported&nbsp;</li> \n <li>Asset architecture enables incorporation of custom modules to extend or change existing functionality BUT asset source code is NOT available to consumers &nbsp;</li> \n <li>Asset architecture does NOT enable incorporation of custom modules to extend or change existing functionality AND asset source code is NOT available to consumers &nbsp;</li> \n</ul>","questionId":"f5c1937e-dff4-4f46-a6bd-8eabaa78e77b","scoreCriteria":"<p>Asset source code is available to consumers AND asset architecture enables incorporation of custom modules to extend or change existing functionality AND 3rd party contributions for enhancements and/or bug fixes are permitted&nbsp;<strong>5</strong></p> \n<p>Asset source code is available to consumers AND asset architecture enables incorporation of custom modules to extend or change existing functionality OR<strong>&nbsp;</strong>3rd party contributions for enhancements and/or bug fixes are supported&nbsp;<strong>4</strong></p> \n<p>Asset source code is available to consumers OR asset architecture enables incorporation of custom modules to extend or change existing functionality BUT 3rd party contributions for enhancements and/or bug fixes are NOT<strong>&nbsp;</strong>supported&nbsp;<strong>3</strong></p> \n<p>Asset architecture enables incorporation of custom modules to extend or change existing functionality BUT asset source code is NOT available to consumers &nbsp;<strong>2</strong></p> \n<p>Asset architecture does NOT enable incorporation of custom modules to extend or change existing functionality AND asset source code is NOT available to consumers&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Change Management"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.249Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:36:45.319Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"f8ceb2c3-5cae-4d2e-b358-daa06085627f","response":"<p>No known accreditation of the asset completed&nbsp;<strong>1</strong></p>","responseId":"240c9021-3e00-4402-8d43-3e27a331e83f","score":1,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T19:03:52.475Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T19:03:52.475Z","updateUser":"devin.shurtleff","evaluationSection":"CA","narrative":"<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Is the asset's Assessment and Authorization (A&amp;A, previously known as C&amp;A) documentation available, discoverable and accessible?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>:&nbsp;To reuse an asset in a secure environment, a consumer needs to be able to easily take the asset through the A&amp;A process which is usually organization-specific, time-consuming, and labor-intensive. Having previous A&amp;A documentation available usually jumpstarts the process and in best cases even expedites it.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS, although for COTS products it is expected that the COTS vendor may not have access to this documentation but would need to point the evaluator to the accredited program that uses the asset.</p> \n<p><strong>Example best answer</strong>:&nbsp;Official asset A&amp;A documentation (e.g., DIACAP checklist, System Architecture diagrams) for operation on a production network is available.</p> \n<p><strong>Example good answer</strong>:&nbsp;Supporting documentation for preparing Interim Authority to test (IATT) or Interim Authority to Operation (IATO) milestones are available.</p> \n<p><strong>Example bad answer</strong>: No A&amp;A documentation available.</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Question</strong></span>:&nbsp;Is the list of systems and their critical A&amp;A players (e.g., Information&nbsp;Assurance official, Certifying official, DAA's)&nbsp;for this asset identified for inferring A&amp;A reciprocity potential?</p> \n<p>&nbsp;</p> \n<p><span style=\"text-decoration: underline;\"><strong>Narrative</strong></span>:&nbsp;To be able to infer&nbsp;Assessment and Authorization (A&amp;A, previously known as C&amp;A)&nbsp;reciprocity potential for an asset,&nbsp;the list of systems containing the asset that have been authorized (accredited) before&nbsp;should be identifiable, as well as their critical A&amp;A (C&amp;A) players. Examples of A&amp;A POCs include Information Assurance official, Certifying official, DAA's, etc.&nbsp;&nbsp;To reuse an asset in a secure environment, a consumer needs to be able to easily take the asset through the A&amp;A process which is usually organization-specific, time-consuming, and&nbsp;labor-intensive. Knowing that an asset has been through the process before is evidence that the process is achievable, which usually bring some level of comfort to the DAA. Further, Being able to inquire about previous A&amp;A efforts can help lower the risks and expedite the process.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer</strong>:&nbsp;At least one authorized system (containing the asset) and that system's A&amp;A POCa have been identified for inquiry about A&amp;A reciprocity.</p> \n<p><strong>Example good answer</strong>: At least one system (containing the asset) is known to be&nbsp;authorized, but C&amp;A POCs have not been identified.</p> \n<p><strong>Example bad answer</strong>:&nbsp;No system (containing the asset) has been identified as being&nbsp;authorized&nbsp;at any level (e.g., production or development); A&amp;A players unknown.</p>","objective":"<p>This question anticipates at least some level of Assessment and Authorization (A&amp;A, previously known as C&amp;A) reciprocity potential for an asset. Examples of A&amp;A POCs include Information Assurance official, Certifying official, DAA's, etc.</p>","qid":"290","question":"<p>Has the asset been evaluated through a DoD A&amp;A process, and if so are the documents available?</p> \n<p>Please provide a list of accredited systems&nbsp; and networks that contain your asset, and any security POCs for those systems.</p> \n<p>If your asset has an A&amp;A package, please provide the documentation, or a link to the documentation.</p>","questionId":"f8ceb2c3-5cae-4d2e-b358-daa06085627f","scoreCriteria":"<p>A&amp;A documentation is provided from the asset provider&nbsp;<strong>5</strong></p> \n<p>List of accredited systems, networks, and&nbsp;Security POCs are&nbsp;provided&nbsp;<strong>4</strong></p> \n<p>List of accredited systems and networks is provided, but no POCs&nbsp;<strong>3</strong></p> \n<p>No A&amp;A documentation and limited accreditation info provided&nbsp;<strong>2</strong></p> \n<p>No known accreditation of the asset completed&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Assessment & Authorization"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.25Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:39:07.255Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"8ade44dd-7cad-406f-a759-7d441141eeac","response":"<p>License is well documented and easy to understand and/or leverages an already defined well-known license (e.g., from&nbsp;<a href=\"http://opensource.org/licenses/category\" rel=\"nofollow\">http://opensource.org/licenses/category</a>).&nbsp; Includes report from license scanning tool&nbsp;<strong>5</strong></p> \n<p><strong><a href=\"https://www.apache.org/licenses/LICENSE-2.0\" rel=\"nofollow\">https://www.apache.org/licenses/LICENSE-2.0</a></strong></p> \n<p>&nbsp;</p> \n<p>&nbsp;</p> \n<p>&nbsp;</p>","responseId":"195ca7d4-1775-45bf-9ba1-65f253198630","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T19:10:44.121Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T19:10:44.121Z","updateUser":"devin.shurtleff","evaluationSection":"LIC","narrative":"<p>The intent of this question is to make sure the asset license terms are clearly stated and understandable, and that there is no question on the part of the potential consumer on what the license terms for using the asset are.&nbsp; Determining which licenses are used for software and what the restrictions are is a complex problem - in fact there are a number of COTS vendors who have tools to help deal with this exact problem. Assets that score poorly for the criterion would be those that don't have any documentation on what licenses are used or what the overall effect of those licenses are. Middle scores would be those assets that describe in the documentation what license(s) are in use and any other encumbrances or restrictions. The highest scoring assets would have detailed dependencies and descriptions of the licenses in use, and have been scanned by a tool similar to the COTS tools that determine open source and license usage. The report from the tool could be included to provide additional useful documentation on the licensing. &nbsp;</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p><strong>Example best answer:&nbsp;</strong>Yes, license is well documented and easy to understand and/or leverages an already defined well-known license (e.g., from&nbsp;<a href=\"http://opensource.org/licenses/category\" rel=\"nofollow\">http://opensource.org/licenses/category</a>).&nbsp; Includes report from license scanning tool.</p> \n<p><strong>Example good answer:&nbsp;</strong>License is documented and consistently applied across all code, but the license itself has areas that are not clear and needs interpretation.</p> \n<p><strong>Example bad answer:&nbsp;</strong>License is not documented or well defined; rights and licenses are inconsistently placed in code (or absent), license is very confusing and appears internally inconsistent.</p>","objective":"<p>The intent of this question is to make sure the asset license terms are clearly stated and understandable, and that there is no question on the part of the potential consumer on what the license terms for using the asset are.</p> \n<p>Licensing terms for an asset should be clearly defined and documented.</p>","qid":"300","question":"<p>How well documented are the license agreement terms and conditions?</p> \n<p>Please provide a link to, or describe, any licensing terms or requirements for your asset</p>","questionId":"8ade44dd-7cad-406f-a759-7d441141eeac","scoreCriteria":"<p>License is well documented and easy to understand and/or leverages an already defined well-known license (e.g., from&nbsp;<a href=\"http://opensource.org/licenses/category\" rel=\"nofollow\">http://opensource.org/licenses/category</a>).&nbsp; Includes report from license scanning tool&nbsp;<strong>5</strong></p> \n<p>License terms are clear and understandable, but does not leverage any pre-defined well-known license (i.e., it is proprietary to this asset)&nbsp;<strong>4</strong></p> \n<p>License is documented and available (e.g., via website), but some of the terms are not clear&nbsp;<strong>3</strong></p> \n<p>License is either inconsistently documented, or is not clear&nbsp;<strong>2</strong></p> \n<p>There is very limited or no license information provided&nbsp;<strong>1</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Licensing"},"workflowStatusDescription":"Complete"},{"storageVersion":"3","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.252Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:42:00.797Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"<p>This doesn't look like it has been touched for multiple years. Some of the dates are from 2015.</p>","questionId":"decf8617-3616-40a8-841c-383522cf25c7","response":"<p>The roadmap is available via a public web site&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p>The roadmap has associated dates&nbsp;<strong>+1</strong></p> \n<p><strong><a href=\"https://apex.apache.org/roadmap.html\" rel=\"nofollow\">https://apex.apache.org/roadmap.html</a></strong></p> \n<p>&nbsp;</p> \n<p>&nbsp;</p> \n<p>&nbsp;</p>","responseId":"862e3fb8-6c06-4b69-9b6b-78d114529c9c","score":2,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T19:13:56.538Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T19:13:56.538Z","updateUser":"devin.shurtleff","evaluationSection":"RM","narrative":"<p>Development planning cycles are typically fairly long, and for a complex ecosystem of components and consumers planning can become particularly difficult. In order to make this easier and to provide additional confidence to consumers the POR should have a roadmap for the asset covering approximately the next three releases.&nbsp;</p> \n<p>If we look to the software industry as an example we see that roadmaps are a required part of a product's information - without it consumers have difficulty understanding how the software will be evolving and it hampers sales (sales are analogous to reuse in our environment). There is typically also some expectation that the roadmap will adjust based upon user feedback.</p> \n<p>The product roadmap may not be (typically won't be) included in the software and documentation and will likely have to be obtained directly from the POR. If it is included in the documentation that is an indicator that the POR is forward thinking and understands the value of communicating longer term plans. To evaluate review the plan and look for plans that provide good details in the short term (one release) and become more vague in the later releases. Plans that provide high levels of details 5 releases out are likely mostly fictional and can actually do more harm than good. Also see how difficult it is for the POR to produce a plan - is it something they have on hand or did they create it just for your request? A mechanism for capturing high level and long term user needs is also a positive sign.</p> \n<p>This question applies equally to COTS, GOTS, FOSS and GOSS.</p> \n<p>&nbsp;</p> \n<p><strong>Example best answer:</strong>&nbsp;Yes, and it includes a timeline going out at least three major releases.&nbsp; Also, there is a mechanism for user/developer/admin input.</p> \n<p><strong>Example good answer:</strong>&nbsp;Yes, but it only provides the expected order of evolution of capabilities (i.e. no timeline).</p> \n<p><strong>Example bad answer:&nbsp;</strong>No roadmap provided</p>","objective":"<p>To provide additional confidence to consumers, the asset provider should have a roadmap for the asset covering approximately the next three releases.&nbsp; Even better is if there is a mechanism for user/developer/admin input.</p> \n<p>The roadmap should generally include enhancements or new features. The roadmap may also include deployment, A&amp;A and funding milestones - and/or when bug fixes will be made available.</p>","qid":"310","question":"<p>Is the asset roadmap up to date and easy to access?</p> \n<p>Please provide a link to the current roadmap for your asset.&nbsp;</p> \n<p>If a link is not available, can the roadmap be obtained in an alternate way.</p> \n<p>How often is the roadmap updated?</p>","questionId":"decf8617-3616-40a8-841c-383522cf25c7","scoreCriteria":"<div class=\"table-wrap\">\n  &nbsp; \n</div> \n<p>The roadmap is available via a public web site&nbsp;<strong>+1</strong></p> \n<p>The roadmap identifies major feature upgrades for at least the year&nbsp;<strong>+1</strong></p> \n<p>The roadmap identifies features and bug fixes allocated over at least the next three releases&nbsp;<strong>+1</strong></p> \n<p>The roadmap has associated dates&nbsp;<strong>+1</strong></p> \n<p>The roadmap is current and maintained&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p><strong>Add the numbers to the right of each item above. If none are selected, the minimum score is a 1.</strong></p>","evaluationSectionDescription":"Roadmap"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.253Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:40:35.944Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"2b70d25a-2b20-4365-9707-1c305c1d6be5","response":"<p><strong>Asset is FOSS</strong></p> \n<p>Bug fixes and enhancements are regularly made available via the open source version of the asset&nbsp;<strong>5</strong></p>","responseId":"d20be1e0-6d48-4eaa-ac1f-16be8db4d5a7","score":5,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T19:16:20.864Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T19:16:20.864Z","updateUser":"devin.shurtleff","evaluationSection":"WIL","narrative":"<p>The intent of this question is to make sure that the asset owner has expressed a willingness to support the asset as a \"re-usable enterprise asset\" as opposed to only supporting it for their own internal needs (or dropping support for it altogether).&nbsp; In order for an asset to be reused, the reusers must have confidence that the asset will not languish unchanged forever and that there is some mechanism to get bugs fixed and issues addressed (potentially including things like help with debugging problems). Support for the asset can be accomplished in a number of ways, a minimum of which includes:</p> \n<ul> \n <li>The owning POR maintains and manages the asset as an enterprise asset. Ideally they build and maintain the asset truly as a separate component and then integrate it back into their own system just like other consumers would do (see&nbsp;<a href=\"http://en.wikipedia.org/wiki/Eat_your_own_dog_food\" rel=\"nofollow\">Eating your own dog food</a>). The owning POR has mechanisms to accept bugs/issues/enhancement requests from external customers (note that may be facilitated via the DI2E Framework).</li> \n <li>The code is made available (in buildable condition - not just a source dump) at a government location such as the DI2E Framework developer environment. This is analogous to code escrow often required for small COTS vendors when large commercial organizations purchase their products - the code escrow reduces the risk to the organization if the small vendor goes out of business. This is not the optimal solution but does ensure that the consumer of the asset can pick up maintenance if necessary (i.e., the original owning POR stops supporting the asset or goes away).&nbsp;</li> \n <li> <p>The POR has the desire to and/or sets up the processes to support being an enterprise service/capability provider.&nbsp;Programs that are unwilling generally totally ignore or otherwise spend no time or money at all in setting up processes/mechanisms to help with re-use (e.g., they hide their code and executables behind firewalls that nobody can access, etc.).&nbsp;</p> \n  <div>\n    &nbsp; \n  </div> </li> \n</ul> \n<p>Additionally the following will also help with long term support of an asset:</p> \n<ul> \n <li>The asset can be made available as open source (FOSS or GOSS). Then each POR who uses the asset can make their own fixes and changes as necessary - hopefully coordinating with the broader community to prevent forking.&nbsp;</li> \n <li>Establishment of overall mechanisms to allow for a community to communicate about the asset - e.g., plans and issues, roadmaps, etc.</li> \n <li>Long term funding for the asset exists. Even if the POR is willing to support the asset they may not have the funding profile to fulfill their desires. Most programs don't share funding information so this is a more difficult aspect to assess. Again note that the DI2E Framework or other organizations with an enterprise focus (such as USD(I) itself) may be providing funding to support enterprise assets as well.&nbsp;</li> \n</ul> \n<p>There are various shades to this - most often the typical case will be that the POR will continue to build and enhance the asset as part of the continued maintenance of their system, but they aren't really treating it as an enterprise asset.</p> \n<p><strong>Example best answer:</strong>&nbsp;Yes. The POR has explicitly stated that they will support the asset as an enterprise asset and has applied funding to do so.</p> \n<p><strong>Example good answer:</strong>&nbsp;The POR has stated they will support others' use of the asset on a limited basis, but due to funding or other constraints are not willing to support the asset as a full enterprise asset.&nbsp;</p> \n<p><strong>Example bad answer:&nbsp;</strong>No, the POR is not willing to support the asset as an enterprise asset.</p> \n<p>N/A for COTS products</p>","objective":"<p>The intent of this question is to make sure that the asset owner has expressed a willingness to support the asset as a \"re-usable enterprise asset\" as opposed to only supporting it for their own internal needs (or dropping support for it altogether)</p>","qid":"320","question":"<p>How willing are you to support the asset at an Enterprise Level?</p> \n<p>There are different answsers for COTS vs GOTS vs Open Source: Please identify which of the following applies to your willingness to support the enterprise use of your asset:</p> \n<p>Asset is COTS and currently supported</p> \n<p>Asset is GOTS or GOSS</p> \n<ul> \n <li>You are willing to support the asset for enterprise re-use</li> \n <li>You are willing to support a limited number of users for the asset as a 're-usable enterprise asset</li> \n <li>You will share any bug fixes or enhancements with the enterprise - but are not willing to \"support\" the enterprise</li> \n <li>Asset is GOTS and you are not willing to share asset updates with the enterprise</li> \n <li>Asset is GOSS but there is no active effort to maintain the baseline or&nbsp;funding has ended so there is no one left to support the asset</li> \n</ul> \n<p>Asset is FOSS</p> \n<ul> \n <li>Bug fixes and enhancements are regularly made available via the open source version of the asset</li> \n <li>Bug fixes and enhancements are regularly provided to paying customers but only to the open source version of the asset at periodic intervals (i.e., after some delay)</li> \n <li>Limited support is provided (e.g., enhancements and bug fixes are ad-hoc, small support team, etc.)</li> \n <li>There is no active effort to maintain the baseline</li> \n</ul>","questionId":"2b70d25a-2b20-4365-9707-1c305c1d6be5","scoreCriteria":"<p><strong>Asset is COTS</strong></p> \n<p>Asset is currently supported&nbsp;<strong>5</strong></p> \n<p>Asset is no longer supported<strong>&nbsp;1</strong></p> \n<p>&nbsp;</p> \n<p><strong>Asset is GOTS or GOSS</strong></p> \n<p>You are willing to support the asset for enterprise re-use&nbsp;<strong>5</strong></p> \n<p>You are willing to support a limited number of users for the asset as a 're-usable enterprise asset&nbsp;<strong>4</strong></p> \n<p>You will share any bug fixes or enhancements with the enterprise - but are not willing to \"support\" the enterprise&nbsp;<strong>3</strong></p> \n<p>Asset is GOTS and you are not willing to share asset updates with the enterprise&nbsp;<strong>2</strong></p> \n<p>Asset is GOSS but there is no active effort to maintain the baseline or&nbsp;funding has ended so there is no one left to support the asset&nbsp;<strong>1</strong></p> \n<p>&nbsp;</p> \n<p><strong>Asset is FOSS</strong></p> \n<p>Bug fixes and enhancements are regularly made available via the open source version of the asset&nbsp;<strong>5</strong></p> \n<p>Bug fixes and enhancements are regularly provided to paying customers but only to the open source version of the asset at periodic intervals (i.e., after some delay)&nbsp;<strong>4</strong></p> \n<p>Limited support is provided (e.g., enhancements and bug fixes are ad-hoc, small support team, etc.)&nbsp;<strong>3</strong></p> \n<p>There is no active effort to maintain the baseline&nbsp;<strong>2</strong></p> \n<p><strong>The number to the right of each item above is the score</strong></p>","evaluationSectionDescription":"Willingness"},"workflowStatusDescription":"Complete"},{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.255Z","createUser":"rex.nethercott","updateDts":"2017-10-04T19:41:39.864Z","updateUser":"brigham.michaelis","checklistId":"0ba92973-f5c2-4e6e-af2d-9f4c52eff6c0","privateNote":"","questionId":"8bd1872b-a95f-4ee8-bc2e-749afb8b7f43","response":"<p>Covers user, developer, test and administrative aspects&nbsp;<strong>+1</strong></p> \n<p>Is well organized&nbsp;<strong>+1</strong></p>","responseId":"3c731d2b-6831-43e8-8d87-a658749a9aef","score":2,"workflowStatus":"COMPLETE","question":{"storageVersion":"1","activeStatus":"A","adminModified":true,"createDts":"2017-07-26T19:19:06.817Z","createUser":"devin.shurtleff","updateDts":"2017-07-26T19:19:06.817Z","updateUser":"devin.shurtleff","evaluationSection":"AA","narrative":"<p>Ultimately, documentation exists to help appropriate audiences understand what an asset is, where it is, how to use it, how to extend it, how to integrate with it, etc.&nbsp;</p> \n<p>For this particular question, we are trying to get to whether the Architecture Documentation accomplishes its purpose, or whether it is unhelpful.&nbsp; This is very qualitative, and the only one who can answer the question is someone who is not familiar with the asset and who needs to re-use it.&nbsp; If the documentation is organized in such a way or has so many words in it that it is very difficult for a developer to find the information they are looking for, then it is not helpful.&nbsp; Likewise, if the documentation is not kept up-to-date then it is also not helpful.</p> \n<p>This question applies equally to COTS, GOTS, FOSS, and GOSS.</p>","objective":"","qid":"330","question":"<p>How well is the software architecture documented?</p>","questionId":"8bd1872b-a95f-4ee8-bc2e-749afb8b7f43","scoreCriteria":"<div class=\"table-wrap\">\n  &nbsp; \n</div> \n<p>Fully describes the architecture&nbsp;<strong>+1</strong></p> \n<p>Covers user, developer, test and administrative aspects&nbsp;<strong>+1</strong></p> \n<p>Is well organized&nbsp;<strong>+1</strong></p> \n<p>Is kept up-to-date as it is used&nbsp;<strong>+1</strong></p> \n<p>Contains mappings to DoDAF, JARM, JCFSL, or DI2E Architecture&nbsp;<strong>+1</strong></p> \n<p>&nbsp;</p> \n<p><strong>Add the numbers to the right of each item above. If none are selected, the minimum score is a 1.</strong></p>","evaluationSectionDescription":"Architecture Alignment"},"workflowStatusDescription":"Complete"}]},"contentSections":[{"section":{"storageVersion":"9","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.264Z","createUser":"rex.nethercott","updateDts":"2017-10-24T16:29:34.918Z","updateUser":"rex.nethercott","content":"<p>&nbsp;Internal architecture information is not readily available, as Apex is a self-contained library. &nbsp;However, the Apex stack can be visualized as in Figure 2 below:</p>\n<p><img src=\"https://confluence.di2e.net/download/attachments/202592279/image2017-10-16_15-9-59.png?version=1&amp;modificationDate=1508188199272&amp;api=v2\" alt=\"\" /></p>\n<p><strong>Figure 2: Apex Stack</strong></p>\n<p>&nbsp;</p>\n<p>Here we include the link to the source code.</p>\n<p>&nbsp;<a href=\"https://github.com/apache/apex-core\">https://github.com/apache/apex-core</a></p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>","contentSectionId":"e3814548-f714-49eb-94c3-f327f194f0fd","entity":"Evaluation","entityId":"741a5ef6-f0f2-426e-80a7-df454e0703f1","noContent":false,"privateSection":false,"templateId":"4da072a4-1945-4c63-9c20-e4aa17912394","title":"Architecture Overview","workflowStatus":"OPEN"},"subsections":[{"storageVersion":"9","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.281Z","createUser":"rex.nethercott","updateDts":"2017-10-24T16:29:34.928Z","updateUser":"rex.nethercott","content":"<p>Hadoop, Maven and the Java SDK are required for Apache Apex</p>","contentSectionId":"e3814548-f714-49eb-94c3-f327f194f0fd","customFields":[],"hideTitle":false,"noContent":false,"order":0,"privateSection":false,"subSectionId":"1fe4a8ae-aab9-4373-b469-6c29df3dc147","title":"Dependencies"}]},{"section":{"storageVersion":"17","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.288Z","createUser":"rex.nethercott","updateDts":"2017-10-24T16:29:16.577Z","updateUser":"rex.nethercott","content":"<p>Installation instructions for the Apex framework were not clearly organized into any unified installation guide. As Apex is closely tied to Hadoop, it appears necessary for users to go through the Hadoop installation process. Beyond that, information on installing Apex by itself was not found. However, it is possible to set up a machine with a mock Hadoop instance in order to test Apex itself. DataTorrent provides a virtual machine image with the necessary Hadoop dependencies already provided, and this was used for testing. In addition to Hadoop, Apex also requires Maven and the Java software development kit (SDK).</p>\n<p>&nbsp;For the purposes of evaluation a Virtual Machine appliance was downloaded and used from the internet. Link is <a href=\"https://www.datatorrent.com/download/\">here</a>. This file created a VM image that would start with Hadoop services already up and running, as well as a current installation of apex, maven, and the Java SDK.</p>\n<p>&nbsp;</p>\n<p>The file that is downloaded is a virtual box appliance file, this file will build the VM preseeded with values.&nbsp;</p>\n<p>To build the VM in virutal box:</p>\n<p>1. Go to: File &gt;&gt; Import Appliance &gt;&gt; (location of .ova file) &gt;&gt; Next &gt;&gt; (Accept the defaults) &gt;&gt; Import.</p>\n<p>2. After the imort step the VM can be started as normal.</p>","contentSectionId":"6185ccb2-6238-4698-9f36-f793ad49a61e","entity":"Evaluation","entityId":"741a5ef6-f0f2-426e-80a7-df454e0703f1","noContent":false,"privateSection":false,"templateId":"3960223d-3e62-47e9-b70f-666bfc2d5d54","title":"Installation","workflowStatus":"OPEN"},"subsections":[]},{"section":{"storageVersion":"12","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.306Z","createUser":"rex.nethercott","updateDts":"2017-10-11T19:58:08.099Z","updateUser":"rex.nethercott","content":"<p>Testing was performed with a downloadable appliance for VirtualBox found <a href=\"https://www.datatorrent.com/download/\">here</a>. This appliance creates a virtualization of Ubuntu 14.04 with Hadoop services ready at start up. Also included is an Installation of Apex, Maven, and the Java SDK.</p>\n<ol>\n<li>The following set up was used in Testing:</li>\n</ol>\n<ul>\n<li>16 GB RAM DDR3 (sodimm)</li>\n<li>intel core i7 4700MQ&nbsp;@ 2.4GHz</li>\n<li>64 bit operating system (Linux Mint)</li>\n<li>250 GB SSD</li>\n<li>NVIDIA Quadro K3100M (CUDA ENABLED)</li>\n</ul>\n<p>For the testing environment 8GB of RAM were devoted to the virtualization along with 2 processing cores(4 threads) and 64MB of video RAM.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>","contentSectionId":"5d4349aa-5f52-4d17-907d-99bf18c7d194","entity":"Evaluation","entityId":"741a5ef6-f0f2-426e-80a7-df454e0703f1","noContent":false,"privateSection":false,"templateId":"fa85b919-3b1a-4386-8597-95ad9185e631","title":"Test Summary","workflowStatus":"OPEN"},"subsections":[{"storageVersion":"12","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.322Z","createUser":"rex.nethercott","updateDts":"2017-10-11T19:58:08.108Z","updateUser":"rex.nethercott","content":"<p>Here we show and discuss two tests that were performed for Apache Apex</p>\n<h3>Test 1.</h3>\n<p>The test steps are found online:</p>\n<p><a href=\"http://docs.datatorrent.com/tutorials/topnwords-c2/\">http://docs.datatorrent.com/tutorials/topnwords-c2/</a></p>\n<p>Basically this program accepts as input; a number of text files and outputs a single file that contains distinct words and how many times each word was encountered in the input files.</p>\n<p>&nbsp;</p>\n<p>This test could not be completed.&nbsp;</p>\n<p>The tester was unable to successfully launch the application in the Data Torrent console on the VM.</p>\n<p>The following error page was produced detailing a number of errors that were encountered.</p>\n<p>&nbsp;<img src=\"Media.action?SectionMedia&amp;mediaId=ad45719a-9e17-48cd-b794-e338e87d08cb\" alt=\"\" /></p>\n<p>&nbsp;It is believed that this error was the result of lack of knowledge about how various programs interact with each other and is not reflective of the true performance of this asset.&nbsp;</p>\n<p>&nbsp;</p>\n<h3>&nbsp;Test 2.</h3>\n<p>&nbsp;For this test we are going to be following the tutorial for a pi calculation that uses a monte-carlo method.</p>\n<p>The test instructions are found by navigating to:</p>\n<p><a href=\"http://docs.datatorrent.com/demos/\">http://docs.datatorrent.com/demos/</a></p>\n<p>Test Steps Taken:</p>\n<ol>\n<li>Start the VM\n<ol>\n<li>Wait a few minutes for the HDFS services to start up</li>\n</ol>\n</li>\n<li>Login to the datatorrent console</li>\n<li>Navigate to \"AppFactory\".(The link is in the title bar)</li>\n<li>Select Demos and Examples\n<ol>\n<li>Select the Pi Demo and click Import</li>\n</ol>\n</li>\n<li>Now go to Develop &gt; Application Packages\n<ol>\n<li>Locate the Pi Demo and click the launch button.</li>\n</ol>\n</li>\n<li>Proceed with the default options and click the launch button.\n<ol>\n<li>Navigate to the monitor section of the console or follow the link in the confirmation &nbsp;dialog box.</li>\n</ol>\n</li>\n</ol>\n<p>Now the application should be up and running.</p>\n<p>We can see some screen shots of it running here:</p>\n<p>&nbsp;</p>\n<p>Main Console view:</p>\n<p><img src=\"Media.action?SectionMedia&amp;mediaId=eecfde1f-6f44-4aeb-8739-1234374b74cc\" alt=\"\" width=\"1231\" height=\"762\" /></p>\n<p>&nbsp;</p>\n<p>DAG or pipeline of flow:</p>\n<p><img src=\"Media.action?SectionMedia&amp;mediaId=2f72c619-6e74-49ed-be8a-9960427a3c9c\" alt=\"\" width=\"1246\" height=\"771\" /></p>\n<p>Results located in std::out:</p>\n<p>Here is shown how at the start the approximation for pi is relatively poor. But as time goes on...</p>\n<p><img src=\"Media.action?SectionMedia&amp;mediaId=2a4f9831-b8dd-4cc0-990a-7e0a247bfe05\" alt=\"\" width=\"730\" height=\"746\" /></p>\n<p>The approximation becomes better and better.</p>\n<p><img src=\"Media.action?SectionMedia&amp;mediaId=b269779e-aabf-4f9d-b851-ba343e7571de\" alt=\"\" width=\"735\" height=\"631\" /></p>\n<p>&nbsp;</p>","contentSectionId":"5d4349aa-5f52-4d17-907d-99bf18c7d194","customFields":[],"hideTitle":false,"noContent":false,"order":0,"privateSection":false,"subSectionId":"d05a942f-ba9e-4989-a7ae-32e3e4354b0e","title":"Test Cases"}]},{"section":{"storageVersion":"2","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.329Z","createUser":"rex.nethercott","updateDts":"2017-10-04T21:12:39.759Z","updateUser":"rex.nethercott","content":"<p><strong>Evaluator Notes: &nbsp;</strong></p>\n<p>Keep notes that you don't want to publish here.</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Installation not performed for initial evaluation.</p>\n<p>&nbsp;</p>\n<p>Here are some of the step I performed to intall APEX. (I think &nbsp;these are correct, I might be looking in the wrong place)</p>\n<p>&nbsp;</p>\n<p>First we install with:</p>\n<p>% sudo apt install git</p>\n<p>% sudo apt install maven</p>\n<p>% sudo apt install openjdk-8-jdk</p>\n<p>% sudo apt-cache search jdk</p>\n<p>% sudo export JAVA_HOME = /usr/lib/jvm/Java-8-openhdk-amd64</p>\n<p>% export PATH=$PATH:/usr/lib/jvm/java-8-openjdk-amd64/bin</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p>Also did something with Docker.</p>","contentSectionId":"5cb07789-ecae-4625-b7a5-0fb84d51d132","entity":"Evaluation","entityId":"741a5ef6-f0f2-426e-80a7-df454e0703f1","noContent":false,"privateSection":true,"templateId":"704064b2-add7-4304-a533-b3acb397a84e","title":"Private Notes","workflowStatus":"OPEN"},"subsections":[]}],"evaluation":{"storageVersion":"11","activeStatus":"A","adminModified":true,"createDts":"2017-09-11T23:10:18.19Z","createUser":"rex.nethercott","updateDts":"2017-10-25T14:16:23.346Z","updateUser":"stan.burlingame","allowNewSections":false,"allowNewSubSections":false,"assignedGroup":"","assignedUser":"brigham.michaelis","componentId":"9ce7354d-42e1-43ac-8a6e-c0ffd668b4fd","evaluationId":"741a5ef6-f0f2-426e-80a7-df454e0703f1","originComponentId":"d81d9299-7d55-4535-a332-b7f4e82faf26","published":false,"templateId":"a14f5fd9-53b4-4571-b68a-069e70a5745c","version":"3.6.0","workflowStatus":"COMPLETE"}}